var BattleJson = [
{ "mapname": "黄巾之乱", "mapid": 1, "list": [{ "id": 1000, "type": 1, "BattleName": "山贼四起", "titleindex": 0, "top": 67, "left": 40, "iconid": 1, "time": "360,360", "HandIcon": "100,101", "NpcName": "山贼喽啰,山贼头目", "detail": "此山是我开，要从此处过，拿命来。|杀了我兄弟，拿命来。", "Reward": "20,60,345,0|30,60,350,0", "GetItem": "0|0", "battleLV": "1,2" }, { "id": 1001, "type": 1, "BattleName": "黄巾前哨", "titleindex": 1, "top": 118, "left": 112, "iconid": 2, "time": "360,360,360", "HandIcon": "102,1300,1304", "NpcName": "黄巾先锋,邓茂,张曼成", "detail": "我们乃黄巾先锋，浑水摸鱼最拿手。|大胆，敢挡将军去路？|无名小辈，快来受死！", "Reward": "30,60,350,0|40,60,355,0|50,60,360,0", "GetItem": "0|0|1000", "battleLV": "2,2,3" }, { "id": 1002, "type": 1, "BattleName": "颍川之战", "titleindex": 2, "top": 73, "left": 181, "iconid": 3, "time": "360,360,360,360", "HandIcon": "102,103,1305,1302", "NpcName": "黄巾前军,黄巾中军,何仪,程远志", "detail": "大哥手下留情，大家混口饭吃不容易。|俺们粗人，动手不动口。|此路不通，给我站住。|子曾经曰过：啊呀！", "Reward": "50,60,360,0|60,60,365,0|70,60,370,0|70,60,375,0", "GetItem": "1100|1200|1300|1400", "battleLV": "3,3,4,4" }, { "id": 1003, "type": 1, "BattleName": "曲阳之战", "titleindex": 3, "top": 94, "left": 268, "iconid": 3, "time": "420,420,420,420,420", "HandIcon": "102,104,1300,1303,2020", "NpcName": "黄巾勇士,黄巾精锐,波才,张燕,张梁", "detail": "抢钱抢粮抢地盘咯。|管将军说了，交粮不杀。|既然来了，就别想走了！|大家上啊，保护将军。|我乃人公将军张梁，还不下马受降？", "Reward": "80,80,375,0|90,80,380,0|110,80,385,0|120,80,390,0|130,80,390,0", "GetItem": "0|0|0|1001|1101,6840", "battleLV": "5,5,6,6,7" }, { "id": 1004, "type": 1, "BattleName": "广宗之战", "titleindex": 4, "top": 149, "left": 335, "iconid": 4, "time": "420,420,420,420,420", "HandIcon": "104,103,1301,2021,2022", "NpcName": "黄巾精锐,黄巾精英,管亥,张宝,张角", "detail": "完了完了，挡不住了。|又来一个，吃我一刀。|我家将军是好人啊，没他就没饭吃啦！|我乃地公将军张宝，还我张梁来。|苍天已死，黄天当立，吾乃天公张角，咳咳。", "Reward": "140,80,395,0|140,80,400,0|140,80,400,0|140,80,400,0|150,80,405,0", "GetItem": "0|0|1201|1301,6840|1401,6840", "battleLV": "7,8,8,9,10" }, { "id": 8000, "type": 2, "BattleName": "汉阳祭坛", "titleindex": 8000, "top": 152, "left": 201, "iconid": 100, "time": "0,0,0,0,0,0", "HandIcon": "0,0,0,0,0,0", "NpcName": "太平道观,北角法场,天罡古道,南山通道,玉虚清池,三", "detail": "0|0|0|0|0|0", "Reward": "55,100,95,20|65,120,115,25|65,120,115,25|75,120,135,25|75,120,135,25|85,140,155,30", "GetItem": "7000|7050|7100|7150|7200|6030"}] },
{ "mapname": "董卓乱政", "mapid": 2, "list": [{ "id": 1005, "type": 1, "BattleName": "叛军前哨", "titleindex": 5, "top": 170, "left": 33, "iconid": 2, "time": "420,420,420", "HandIcon": "203,205,1015", "NpcName": "西凉斥候,西凉先锋,胡轸", "detail": "敌袭！敌袭！兔崽子们都给我打起精神来！|不知死活的家伙，竟敢来挑战我西凉军。|俺是华雄将军副将！俺就能收拾你们这些小贼。", "Reward": "160,80,410,0|160,80,410,0|170,80,410,0", "GetItem": "0|0|1002", "battleLV": "11,11,12" }, { "id": 1006, "type": 1, "BattleName": "汜水外境", "titleindex": 6, "top": 76, "left": 80, "iconid": 3, "time": "420,420,420,420", "HandIcon": "203,205,1103,2023", "NpcName": "汜水前军,汜水中军,樊稠,华雄", "detail": "我等乃华雄大将帐下精兵，何人敢犯。|看我替华将军将你们一刀两段，两刀四段。|太师乃汉室忠臣，保扶幼主，逆贼竟敢来犯！|好狂妄的小子，拿着杯酒还敢来挑战本将。", "Reward": "170,90,410,0|170,90,415,0|180,90,415,0|180,90,415,0", "GetItem": "0|0|1102|1202,6840", "battleLV": "12,12,13,13" }, { "id": 1007, "type": 1, "BattleName": "虎牢关", "titleindex": 7, "top": 123, "left": 162, "iconid": 5, "time": "420,420,420,420,480", "HandIcon": "203,205,1014,1203,3303", "NpcName": "虎牢守卫,虎牢精锐,张济,李肃,吕布", "detail": "哈哈，你已落入我军师计中，还不快快投降。|儿郎们，让他们看看我西凉军的厉害。|若能放我一马，愿将爱妻献给将军！|误会了，误会了，我乃汉室忠臣，一心谋除董贼！|战神在此，尔等还不快快来受死！", "Reward": "180,90,420,0|190,90,420,0|190,90,420,0|190,90,420,0|200,100,425,0", "GetItem": "0|0|1302|1402,6840|1003,6840", "battleLV": "13,14,14,14,15" }, { "id": 1008, "type": 1, "BattleName": "火烧洛阳", "titleindex": 8, "top": 75, "left": 245, "iconid": 4, "time": "480,480,480,480,480", "HandIcon": "203,205,1003,1007,2040", "NpcName": "西凉守卫,西凉精锐,牛辅,郭汜,卢植", "detail": "打败了我也不要紧，此计名引蛇出洞，自寻死路！|混帐！你们这群蠢材，敌人都到家门口了，给我上。|董太师女婿中郎将在此，何方小贼，还不下马请降。|爷爷手中的钢枪千锤百炼，一枪就能给你添两个窟窿！|子干命薄，死于将军刀下，我又何怨。", "Reward": "200,100,425,0|200,100,425,0|210,100,430,0|210,100,430,0|220,100,435,0", "GetItem": "0|0|0|1103|1203,6840", "battleLV": "15,16,16,17,17" }, { "id": 1009, "type": 1, "BattleName": "长安之战", "titleindex": 9, "top": 150, "left": 336, "iconid": 4, "time": "480,480,480,480,480", "HandIcon": "203,205,1107,2043,3301", "NpcName": "飞熊守卫,飞熊精锐,赵岑,李儒,董卓", "detail": "飞熊铁骑皆是西凉老兵，誓死追随董太师！|军师，这不是引蛇出洞，这是引火烧身啊。|曹孟德也非吾敌手，今日让你瞧瞧我军的厉害。|刘氏灭，董氏兴，此乃天意。将军何不投降太师。|吾乃西凉董卓，天子吾都敢废，你又算哪根葱！", "Reward": "220,100,435,0|240,100,435,0|240,100,440,0|250,100,440,0|260,100,445,0", "GetItem": "0|0|0|1303|1403,6840", "battleLV": "18,18,19,19,20" }, { "id": 8001, "type": 2, "BattleName": "帝王要塞", "titleindex": 8001, "top": 42, "left": 331, "iconid": 101, "time": "0,0,0,0,0,0", "HandIcon": "0,0,0,0,0,0", "NpcName": "要塞大门,飞熊军营,铁羽军营,酒池肉林,金玉花园,万", "detail": "0|0|0|0|0|0", "Reward": "65,140,160,40|80,160,190,45|80,160,190,45|95,160,225,55|95,160,225,55|110,180,255,60", "GetItem": "7000|7050|7100|7150|7200|6031"}] },
{ "mapname": "逐鹿中原", "mapid": 3, "list": [{ "id": 1010, "type": 1, "BattleName": "吴郡乌程", "titleindex": 10, "top": 98, "left": 32, "iconid": 1, "time": "480,480,480", "HandIcon": "1015,1003,2031", "NpcName": "沙摩柯,严白兴,严白虎", "detail": "你们汉人，吹牛，厉害！打仗，不行！|众将士小心应战，不要中了埋伏啊！|乱世英雄起四方，有兵就是草头王！", "Reward": "260,110,445,0|260,110,445,0|260,110,445,0", "GetItem": "0|0|1005,6840", "battleLV": "21,21,22" }, { "id": 1011, "type": 1, "BattleName": "北海之战", "titleindex": 11, "top": 108, "left": 121, "iconid": 3, "time": "480,480,480,480", "HandIcon": "200,203,1011,2028", "NpcName": "北海守卫,北海精锐,刘义逊,孔融", "detail": "我知道这年头汉室宗亲很多，可是我是真的啊！|看我抄你后路！让你们一个也跑不掉！|再向前寸步莫怪我刀下无情！|想要积分？先问我手上的家伙答不答应！", "Reward": "270,110,450,0|270,110,450,0|270,110,450,0|290,110,450,0", "GetItem": "0|1105|1205|1305,6840", "battleLV": "22,22,23,23" }, { "id": 1012, "type": 1, "BattleName": "幽州之战", "titleindex": 12, "top": 162, "left": 191, "iconid": 3, "time": "480,480,480,480,540", "HandIcon": "202,205,1115,1003,2027", "NpcName": "幽州守卫,幽州精锐,公孙范,田楷,公孙瓒", "detail": "来将休走，看我与你大战三百回合！|降了吧！将来我做燕王，就封你做大将军！|看你哆嗦的！是冻的还是怕的?|洗干净脖子，我来替主公取你人头！|我有白马义从！我会远交近攻！我不怕你！", "Reward": "290,110,450,0|290,110,450,0|310,110,455,0|310,110,455,0|320,120,460,0", "GetItem": "0|0|0|1405|1005,6840", "battleLV": "23,24,24,24,25" }, { "id": 1013, "type": 1, "BattleName": "寿春称帝", "titleindex": 13, "top": 122, "left": 272, "iconid": 4, "time": "540,540,540,540,540", "HandIcon": "200,204,1215,1115,2029", "NpcName": "中原守卫,中原精锐,袁耀,乐就,纪灵", "detail": "站住！此处是淮南地界，岂容擅闯！|百姓什么的都是浮云，我们在饿肚子这才是大事！|不知父亲如何得罪了将军？竟然如此大动干戈..|好凶悍的贼人，纪灵将军你也不怕么。|贼人！看本将替皇上取你人头！", "Reward": "320,120,460,0|320,120,460,0|330,120,465,0|330,120,465,0|350,120,470,0", "GetItem": "0|0|0|1105|1205,6840", "battleLV": "25,26,26,27,27" }, { "id": 1014, "type": 1, "BattleName": "汝南之战", "titleindex": 14, "top": 60, "left": 336, "iconid": 3, "time": "540,540,540,540,540", "HandIcon": "206,200,1015,1111,2030", "NpcName": "汝南守卫,汝南精锐,雷薄,陈兰,袁术", "detail": "快让开！我家主公，不，皇上，还等着我送粮回去呢！|大胆贼人！雷将军率军征粮，竟敢碍事！|看你也是猛将，追随我吧！当然，你的粮食得上缴！|想要我这身宝甲？就得拿出真本事多赢我几次！|真龙天子在此！再敢无礼就用传国玉玺砸你！", "Reward": "350,120,470,0|370,120,475,0|370,120,475,0|380,120,480,0|380,120,480,0", "GetItem": "0|0|0|1305|1405,6840", "battleLV": "28,28,29,29,30" }, { "id": 8002, "type": 2, "BattleName": "中原惊变", "titleindex": 8002, "top": 49, "left": 203, "iconid": 102, "time": "0,0,0,0,0,0", "HandIcon": "0,0,0,0,0,0", "NpcName": "江陵岔道,江东贼王,三尖上将,建安才子,白马将军,玉", "detail": "0|0|0|0|0|0", "Reward": "105,180,205,60|125,200,250,70|125,200,250,70|145,200,290,80|145,200,290,80|165,220,330,90", "GetItem": "7001|7051|7101|7151|7201|6038"}] },
{ "mapname": "群雄争霸", "mapid": 4, "list": [{ "id": 1015, "type": 1, "BattleName": "南攻徐州", "titleindex": 15, "top": 137, "left": 27, "iconid": 3, "time": "540,540,540,540,540", "HandIcon": "203,203,1007,1100,2033", "NpcName": "徐州守卫,徐州精锐,曹宏,麋芳,陶谦", "detail": "天堂有路你不走，地狱无门闯进来，纳命来吧！|看我军歌声雄壮，士气高昂，还不下马投降！|砍一个够本，砍两个赚了！第三个，你给我过来！|能杀到我这里，看来你也是一条好汉！|众将士！得军师令，将这些毛贼杀个干净！", "Reward": "385,130,480,0|385,130,480,0|385,130,480,0|390,130,485,0|390,130,485,0", "GetItem": "0|0|0|1006|1106,6841", "battleLV": "31,31,31,32,32" }, { "id": 1016, "type": 1, "BattleName": "汉中宁王", "titleindex": 16, "top": 63, "left": 117, "iconid": 6, "time": "540,540,540,540,540", "HandIcon": "203,202,1012,1214,2028", "NpcName": "蜀川守卫,蜀川精锐,杨任,杨松,张鲁", "detail": "凭你等毛贼竟能破了前锋？必视用什么鬼蜮伎俩！|俺是粗人，不会说话！你就纳命来吧！|有话好说！别急着打啊！|无名小辈！还不下马受死！|众将士护驾！休叫这毛贼靠近我！", "Reward": "390,130,485,0|390,130,485,0|390,130,485,0|395,130,490,0|395,130,490,0", "GetItem": "0|0|0|1206|1306,6841", "battleLV": "33,33,33,34,34" }, { "id": 1017, "type": 1, "BattleName": "痛失益州", "titleindex": 17, "top": 181, "left": 165, "iconid": 4, "time": "540,600,600,600,600", "HandIcon": "203,202,1214,1102,2035", "NpcName": "荆州守卫,荆州精锐,杨怀,孟达,刘璋", "detail": "眼馋我这柄鬼头刀了？先胜了我再说！|到了这大江之上就由不得你了！束手就擒吧！|我家兄弟都是汉中重臣，你得罪的起么？|我乃巴郡大将，谁来我马前送死？|上天有好生之德，将军何忍生灵涂炭？", "Reward": "395,130,490,0|395,130,490,0|395,130,490,0|400,140,495,0|400,140,495,0", "GetItem": "0|0|0|1406|1008,6841", "battleLV": "35,35,35,36,36" }, { "id": 1018, "type": 1, "BattleName": "江夏之战", "titleindex": 18, "top": 118, "left": 242, "iconid": 5, "time": "600,600,600,600,600", "HandIcon": "203,202,1004,1015,2033", "NpcName": "南郡先锋,江夏精锐,金旋,黄祖,刘表", "detail": "长江天险已失，快回去禀告主公，早做准备吧！|众将士！两位公子也带兵迎战了，拼了！|将军威武，何必与我荆州为敌？不如共图大事！|贼势汹汹，大事不妙！|这荆湘九郡乃大汉的疆土，我乃汉室宗亲，岂能容你！", "Reward": "405,140,500,0|405,140,500,0|405,140,500,0|410,140,500,0|410,140,500,0", "GetItem": "0|0|0|1108|1208,6841", "battleLV": "37,37,37,38,38" }, { "id": 1019, "type": 1, "BattleName": "西凉决战", "titleindex": 19, "top": 57, "left": 343, "iconid": 4, "time": "600,600,600,600,600", "HandIcon": "203,205,1007,1006,2036", "NpcName": "西凉守卫,西凉精锐,马玩,韩遂,马腾", "detail": "肩负着西凉的扩张！我们是天下无人能敌的力量！|群雄四起，逐鹿中原，我们也要分一杯羹！|我乃西凉马玩将军，谁来我马前送死？|这个这个这个……只得以死相拒了！|无名小辈！还不下马受死！", "Reward": "410,140,500,0|410,140,500,0|410,140,500,0|415,140,505,0|415,140,505,0", "GetItem": "0|0|1308|0|1408,6841", "battleLV": "39,39,39,40,40" }, { "id": 8003, "type": 2, "BattleName": "群雄英魂", "titleindex": 8003, "top": 170, "left": 319, "iconid": 103, "time": "0,0,0,0,0,0", "HandIcon": "0,0,0,0,0,0", "NpcName": "安东将军,三代天师,无道之主,正宗皇亲,征西将军,西", "detail": "0|0|0|0|0|0", "Reward": "115,220,210,65|140,240,255,80|140,240,255,80|165,240,295,95|165,240,295,95|185,260,340,100", "GetItem": "7001|7051|7101|7151|7201|6037"}] },
{ "mapname": "战神殒落", "mapid": 5, "list": [{ "id": 1020, "type": 1, "BattleName": "京城失守", "titleindex": 20, "top": 102, "left": 29, "iconid": 4, "time": "600,600,600,600,600", "HandIcon": "203,200,1007,1015,1115", "NpcName": "京城先锋,京城守卫,京城精锐,刘何,成廉", "detail": "众将士随我一起突击恶贼先锋部队。|不知京城先锋的兄弟突击是否成功。|贼势汹汹，刘大人我们快支撑不住了。|京城可能不保，众将士随我撤兵到成将军处。|快报，前方战事如何？", "Reward": "420,150,505,0|420,150,505,0|420,150,505,0|425,150,510,0|425,150,510,0", "GetItem": "0|0|0|1008|1108,6841", "battleLV": "41,41,41,42,42" }, { "id": 1021, "type": 1, "BattleName": "大破黑山", "titleindex": 21, "top": 69, "left": 121, "iconid": 1, "time": "600,600,600,600,600", "HandIcon": "203,200,1007,1008,1007", "NpcName": "黑山草寇,黑山守卫,黑山精锐,王楷,魏续", "detail": "吕将军，黑山众贼愿跟随您逐鹿中原！|黑山已拿下，快快布防。|这么快就攻到了中军？将军你好心急啊...|再向前寸步莫怪我刀下无情！|众将士小心应战，不要中了埋伏啊！", "Reward": "425,150,510,0|425,150,510,0|425,150,510,0|430,150,515,0|430,150,515,0", "GetItem": "0|0|0|1208|1308,6841", "battleLV": "43,43,43,44,44" }, { "id": 1022, "type": 1, "BattleName": "屯兵小沛", "titleindex": 22, "top": 69, "left": 228, "iconid": 3, "time": "600,600,600,660,660", "HandIcon": "203,200,1007,1202,3105", "NpcName": "小沛先锋,小沛守卫,小沛精锐,陈圭,张辽", "detail": "听口音不是本地人吧？|敌人来犯！快回去向主公报信！|小沛地界，岂容你等撒野！|各军振作精神，击破敌军！|你是让我取你首级还是自刎留个全尸？", "Reward": "430,150,515,0|430,150,515,0|430,150,515,0|435,160,520,0|435,160,520,0", "GetItem": "0|0|0|1408|1009,6841", "battleLV": "45,45,45,46,46" }, { "id": 1023, "type": 1, "BattleName": "夺取徐州", "titleindex": 23, "top": 181, "left": 302, "iconid": 4, "time": "660,660,660,660,660", "HandIcon": "203,200,1007,1015,1007", "NpcName": "徐州先锋,徐州守卫,徐州精锐,宋宪,曹性", "detail": "打得赢要打！打不赢也要拼！|老子不屑与你说话！刀刃上见高下！|让你见识见识徐州子弟的勇武！|忠臣不事二主！若败，可速杀我！|吕布这厮若依我计，你还能这等猖狂！", "Reward": "440,160,525,0|440,160,525,0|440,160,525,0|445,160,525,0|445,160,525,0", "GetItem": "0|0|0|1109|1209,6841", "battleLV": "47,47,47,48,48" }, { "id": 1024, "type": 1, "BattleName": "决水围城", "titleindex": 24, "top": 78, "left": 344, "iconid": 3, "time": "660,660,660,660,660", "HandIcon": "203,200,1007,2024,3303", "NpcName": "下邳先锋,下邳守卫,下邳精锐,臧霸,吕布", "detail": "取你的脑袋跟打酱油一样！|有话好说！别急着打啊！|休要猖狂！我军主将随后就到！|天有不测风云，人有旦夕祸福！|大胆的草寇！还我美人来！", "Reward": "445,160,525,0|445,160,525,0|445,160,525,0|450,160,530,0|450,160,530,0", "GetItem": "0|0|0|1309,6841|1409,6841", "battleLV": "49,49,49,50,50" }, { "id": 8004, "type": 2, "BattleName": "白门殒命", "titleindex": 8004, "top": 154, "left": 161, "iconid": 104, "time": "0,0,0,0,0,0", "HandIcon": "0,0,0,0,0,0", "NpcName": "集市街,古圯桥,断头台,衙府署,陷阵营,白门楼", "detail": "0|0|0|0|0|0", "Reward": "200,270,500,65|200,270,550,80|200,270,550,80|200,270,550,95|200,270,550,95|350,280,600,110", "GetItem": "7002|7052|7102|7152|7202|6033"}] },
{ "mapname": "官渡之战", "mapid": 6, "list": [{ "id": 1025, "type": 1, "BattleName": "围攻马白", "titleindex": 25, "top": 125, "left": 37, "iconid": 2, "time": "660,660,660,660,660", "HandIcon": "203,200,1007,1003,1007", "NpcName": "白马先锋,白马守卫,白马精锐,周昂,蒋义渠", "detail": "是神也无法解这白马之围。|有话好说！别急着打啊！|让你见识见识颜家子弟的勇武！|就算你攻破我的防御，后面还有颜将军。|颜将军带着精锐撤离了，我命休已。", "Reward": "455,170,530,0|455,170,530,0|455,170,530,0|460,170,535,0|460,170,535,0", "GetItem": "0|0|0|1009|1109", "battleLV": "51,51,51,51,51" }, { "id": 1026, "type": 1, "BattleName": "屯兵延津", "titleindex": 26, "top": 42, "left": 104, "iconid": 3, "time": "660,660,660,660,660", "HandIcon": "203,200,1007,1203,2037", "NpcName": "延津先锋,延津守卫,延津精锐,陈琳,河北双雄", "detail": "主公的救兵就要到了！各军顶住！|善有善报，恶有恶报！不是不报，时候未到！|兵来将挡！看我文丑大军，一往无前！|延津地界，岂容你等撒野！|我们乃河北双雄，来者还不下马受死！", "Reward": "460,170,535,0|460,170,535,0|460,170,535,0|465,170,540,0|465,170,540,0", "GetItem": "0|0|0|1209|1309,6841", "battleLV": "52,52,52,52,52" }, { "id": 1027, "type": 1, "BattleName": "袭击乌巢", "titleindex": 27, "top": 150, "left": 174, "iconid": 1, "time": "660,660,660,720,720", "HandIcon": "203,200,1007,1011,1211", "NpcName": "乌巢先锋,乌巢守卫,乌巢精锐,淳于琼,辛评", "detail": "想逃就逃吧，你跑出五百步我再追。|要不是饿着肚子，早就把你一刀斩了！|将士们！无路可退，拼了！|你以为我是口蛮刀是吃素的么？|念你也是个英雄，明年的今天老夫定会祭你一壶好酒。", "Reward": "465,170,540,0|465,170,540,0|465,170,540,0|470,180,545,0|470,180,545,0", "GetItem": "0|0|0|1409|1011,6841", "battleLV": "53,53,53,53,53" }, { "id": 1028, "type": 1, "BattleName": "官渡之战", "titleindex": 28, "top": 150, "left": 282, "iconid": 4, "time": "720,720,720,720,720", "HandIcon": "203,200,1007,1110,2040", "NpcName": "官渡先锋,官渡守卫,官渡精锐,麴义,田丰", "detail": "淳将军被你生擒？你当我是三岁小孩么？|快顶不住了……|各军振作精神，击破敌军！|我军占尽地利人和，不日便可破你大军！|不怕死的反贼！你可知我是河北名将！", "Reward": "475,180,550,0|475,180,550,0|475,180,550,0|480,180,550,0|480,180,550,0", "GetItem": "0|0|0|1111|1211,6841", "battleLV": "54,54,54,54,54" }, { "id": 1029, "type": 1, "BattleName": "绝命仓亭", "titleindex": 29, "top": 69, "left": 341, "iconid": 3, "time": "720,720,720,720,720", "HandIcon": "203,200,1007,1211,3304", "NpcName": "仓亭先锋,仓亭守卫,仓亭精锐,郭图,袁绍", "detail": "再向前寸步莫怪我刀下无情！|保卫主公！保卫家乡！|拉弓放箭！先杀一杀敌军锐气！|将军威武，何必与我为敌？不如共图大事！|大胆反贼！今犯我疆土，看我怎么取下你们的首级！", "Reward": "480,180,550,0|480,180,550,0|480,180,550,0|485,180,555,0|485,180,555,0", "GetItem": "0|0|0|1311|1411,6841", "battleLV": "55,55,55,55,55" }, { "id": 8005, "type": 2, "BattleName": "河北枭雄", "titleindex": 8005, "top": 48, "left": 214, "iconid": 105, "time": "0,0,0,0,0,0", "HandIcon": "0,0,0,0,0,0", "NpcName": "冀州营,先锋营,中军帐,望江楼,玉清观,河北枭雄", "detail": "0|0|0|0|0|0", "Reward": "200,270,500,65|200,270,550,80|200,270,550,80|200,270,550,95|200,270,550,95|350,280,600,110", "GetItem": "7002|7052|7102|7152|7202|6034"}] },
{ "mapname": "三战新野", "mapid": 7, "list": [{ "id": 1030, "type": 1, "BattleName": "博望峡谷", "titleindex": 30, "top": 131, "left": 40, "iconid": 2, "time": "720,720,720,720,720,720", "HandIcon": "203,200,1015,1007,1110,2001", "NpcName": "破虏先锋,破虏守卫,破虏禁卫,破虏精锐,文鸯,李典", "detail": "汝等见识见识爷的厉害。|此树是吾栽，此路为吾开。要打此路过，留下狗头来。|明年的今天就是尔等的忌期了。|打打杀杀真没劲。|如若投降，还可保尔等全尸。|速速报上名来，曼成不杀无名之辈。", "Reward": "500,190,600,0|500,190,600,0|500,190,600,0|505,190,605,0|505,190,605,0|510,190,610,0", "GetItem": "0|0|0|0|1011|1111,6841", "battleLV": "56,56,56,56,56,56" }, { "id": 1031, "type": 1, "BattleName": "火烧博望", "titleindex": 31, "top": 44, "left": 97, "iconid": 3, "time": "720,720,720,720,720,720", "HandIcon": "203,200,1015,1007,2354,3103", "NpcName": "建武先锋,建武守卫,建武禁卫,建武精锐,于禁,夏侯惇", "detail": "来者何人？吃吾一击！|乱臣贼子，人人得而诛之。|将军有令，革杀勿论。|兄弟们看好了，这些反贼一个都不能留。|稳重行军，百战不殆！|鼠辈，速来领死！", "Reward": "510,190,610,0|510,190,610,0|510,190,610,0|510,190,610,0|515,190,615,0|515,190,615,0", "GetItem": "0|0|0|0|1211|1311,6841", "battleLV": "57,57,57,57,57,57" }, { "id": 1032, "type": 1, "BattleName": "樊城避曹", "titleindex": 32, "top": 148, "left": 173, "iconid": 4, "time": "720,720,720,720,720,780", "HandIcon": "203,200,1015,1007,2000,2306", "NpcName": "樊城先锋,樊城守卫,樊城禁卫,樊城精锐,周仓,徐庶", "detail": "任你如何侥幸，也只能到此了。|小贼好胆，速速束手就擒，给你一个痛快。|哇呀呀呀~小的们，杀啊！|攻无不克，战无不胜！|这一刀，定要你有来无回！|嘘！言多必失啊。", "Reward": "520,190,620,0|520,190,620,0|520,190,620,0|520,190,620,0|525,200,625,0|525,200,625,0", "GetItem": "0|0|0|0|1411|1012,6841", "battleLV": "58,58,58,58,58,58" }, { "id": 1033, "type": 1, "BattleName": "新野外城", "titleindex": 33, "top": 157, "left": 293, "iconid": 2, "time": "780,780,780,780,780,780", "HandIcon": "203,200,1015,1007,2301,3001", "NpcName": "新野先锋,新野守卫,新野禁卫,新野精锐,关兴,张飞", "detail": "看来尔也算是有点本事了。|能到此，也算你功德圆满了。|善哉、善哉，回头是岸啊。|大胆狂徒，敢打扰本将军休息。|自以为尚迟，疾走不休，绝力而死。|燕人张翼德在此，可敢与我大战三百回合！", "Reward": "530,200,630,0|530,200,630,0|530,200,630,0|530,200,630,0|535,200,635,0|535,200,635,0", "GetItem": "0|0|0|0|1112|1212,6841", "battleLV": "59,59,59,59,59,59" }, { "id": 1034, "type": 1, "BattleName": "火烧新野", "titleindex": 34, "top": 66, "left": 342, "iconid": 3, "time": "780,780,780,780,780,780", "HandIcon": "203,200,1015,1007,2358,2350", "NpcName": "骁骑先锋,骁骑守卫,骁骑禁卫,骁骑精锐,刘晔,曹仁", "detail": "尔等是否活腻了，就让我送你们上西天吧。|哈哈哈，手头正好痒着呢。|儿郎们，取敌人首级者有赏！|取汝等性命，有如剁菜切瓜。|深受王恩，自当尽力尽忠。|尽管来吧，吾倒要看何人敢在此造次。", "Reward": "540,200,640,0|540,200,640,0|540,200,640,0|540,200,640,0|545,200,645,0|545,200,645,0", "GetItem": "0|0|0|0|1312|1412,6841", "battleLV": "60,60,60,60,60,60" }, { "id": 8006, "type": 2, "BattleName": "热血上将", "titleindex": 8006, "top": 51, "left": 217, "iconid": 102, "time": "0,0,0,0,0,0", "HandIcon": "0,0,0,0,0,0", "NpcName": "先锋营,博望峡谷,新野外境,火烧博望,火烧新野,热血", "detail": "0|0|0|0|0|0", "Reward": "220,290,650,65|220,290,700,80|220,290,700,80|220,290,700,95|220,290,700,95|380,300,750,110", "GetItem": "7003|7053|7103|7153|7203|6039"}] },
{ "mapname": "赤壁之战", "mapid": 8, "list": [{ "id": 1035, "type": 1, "BattleName": "樊城前线", "titleindex": 35, "top": 59, "left": 29, "iconid": 3, "time": "780,780,780,780,780,780", "HandIcon": "203,200,1015,1007,2003,3002", "NpcName": "樊城先锋,樊城守卫,樊城禁卫,樊城精锐,关凤,赵云", "detail": "吾乃先锋，够胆就放马过来吧。|经验不是你想买，想买就能买。|想过关，就先让我称称你的斤两吧。|识相的，就在此停步，爷可饶你不死。|百步之内，取你首级。|吾乃常山赵子龙也。", "Reward": "550,220,650,0|550,220,650,0|550,220,650,0|555,220,650,0|555,220,655,0|560,220,655,0", "GetItem": "0|0|0|0|1012|1112,6841", "battleLV": "61,61,61,61,61,61" }, { "id": 1036, "type": 1, "BattleName": "祭坛借风", "titleindex": 36, "top": 167, "left": 74, "iconid": 2, "time": "780,780,780,780,780,780", "HandIcon": "203,200,1015,1007,3004,3007", "NpcName": "祭坛先锋,祭坛守卫,祭坛禁卫,祭坛精锐,黄忠,诸葛亮", "detail": "这里就是鬼门关了。|闲话莫提，先接我这一刀吧。|上头有令，末将等得罪了。|刀口上过日子，不是你死就是我亡。|黄汉升在此，谁人与我大战三百回合。|太极生两仪，两仪生四象，四象生八卦。", "Reward": "560,220,660,0|560,220,660,0|560,220,660,0|560,220,660,0|565,220,665,0|565,220,665,0", "GetItem": "0|0|0|0|1212|1312,6841", "battleLV": "62,62,62,62,62,62" }, { "id": 1037, "type": 1, "BattleName": "鏖战赤壁", "titleindex": 37, "top": 172, "left": 190, "iconid": 5, "time": "780,780,780,780,840,840", "HandIcon": "203,200,1015,1007,3200,3207", "NpcName": "赤壁先锋,赤壁守卫,赤壁禁卫,赤壁精锐,甘宁,周瑜", "detail": "主公的救兵就要到了！各军顶住！|善有善报，恶有恶报！不是不报，时候未到！|兵来将挡！看我东吴大军，一往无前！|天有不测风云，人有旦夕祸福！|我精锐水师在此还不下船受死！|火烧赤壁让曹贼有来无回，哈哈哈…", "Reward": "570,220,670,0|570,220,670,0|570,220,670,0|570,220,670,0|575,230,675,0|575,230,675,0", "GetItem": "0|0|0|0|1412|1014,6842", "battleLV": "63,63,63,63,63,63" }, { "id": 1038, "type": 1, "BattleName": "华容小道", "titleindex": 38, "top": 89, "left": 261, "iconid": 2, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,2300,3000", "NpcName": "华容先锋,华容守卫,华容禁卫,华容精锐,关平,关羽", "detail": "这个这个这个……只得以死相拒了！|无名小辈！还不下马受死！|众将士随我一起突击恶贼先锋部队。|看你哆嗦的！是冻的还是怕的?|天堂有路你不走，地狱无门闯进来，纳命来吧！|一夫当关万夫难，武圣关云长在此等候多时！", "Reward": "580,230,680,0|580,230,680,0|580,230,680,0|580,230,680,0|585,230,685,0|585,230,685,0", "GetItem": "0|0|0|0|1114|1214,6842", "battleLV": "64,64,64,64,64,64" }, { "id": 1039, "type": 1, "BattleName": "江陵追击", "titleindex": 39, "top": 112, "left": 334, "iconid": 4, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,2353,3108", "NpcName": "江陵先锋,江陵守卫,江陵禁卫,江陵精锐,乐进,荀彧", "detail": "凡事皆可商议，何兴刀兵之苦?|看我军歌声雄壮，士气高昂，还不下马投降！|砍一个够本，砍两个赚了！第三个，你给我过来！|能杀到我这里，看来你也是一条好汉！|此处易守难攻，就是你的葬身之地！|年轻人，干戈之事太凶险，与老夫对弈决胜负如何？", "Reward": "590,230,690,0|590,230,690,0|590,230,690,0|590,230,690,0|595,230,695,0|595,230,695,0", "GetItem": "0|0|0|0|1314|1414,6842", "battleLV": "65,65,65,65,65,65" }, { "id": 8007, "type": 2, "BattleName": "吴蜀姻缘", "titleindex": 8007, "top": 74, "left": 140, "iconid": 106, "time": "0,0,0,0,0,0", "HandIcon": "0,0,0,0,0,0", "NpcName": "水兵营,祭坛护卫,水兵先锋,轻骑营,精锐营,吴蜀月老", "detail": "0|0|0|0|0|0", "Reward": "220,290,800,65|220,290,850,80|220,290,850,80|220,290,850,95|220,290,850,95|380,300,900,110", "GetItem": "7003|7053|7103|7153|7203|6040"}] },
{ "mapname": "平定荆州", "mapid": 9, "list": [{ "id": 1040, "type": 1, "BattleName": "争夺南郡", "titleindex": 40, "top": 64, "left": 37, "iconid": 3, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,1210,2350", "NpcName": "南郡先锋,南郡守卫,南郡禁卫,南郡精锐,陈矫,曹仁", "detail": "曹将军让我们坚守勿战，让敌军进退两难|看我铁桶阵法，刀枪不入，吼吼哈嘿！|硬的怕横的，横的怕楞的，愣的怕不要命的，拼了！|兄长不必担心，有我虎豹骑在此，不让东吴接近半步！|不怕东吴猛虎，就怕刘备饿狼！|尽管来吧，看我用丞相锦囊妙计，活捉尔等！", "Reward": "600,250,700,0|600,250,700,0|600,250,700,0|605,250,700,0|605,250,705,0|610,250,705,0", "GetItem": "0|0|0|0|1015|1115,6842", "battleLV": "66,66,66,66,66,66" }, { "id": 1041, "type": 1, "BattleName": "计定零陵", "titleindex": 41, "top": 177, "left": 49, "iconid": 5, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,1114,1214", "NpcName": "零陵先锋,零陵守卫,零陵禁卫,零陵精锐,刘贤,刘度", "detail": "我家邢将军我一对八百斤重的大斧，我劝你快快逃命去吧！|打得过就打，打不过就跑|也不知道邢将军拎不拎得动他那对大斧。|人知道我邢道荣力大无穷，不知道我智勇双全，连孔明都中我计也！|要让刘备做了荆州之主，哪还有我的好日子。|大家不要打了，谁不是娘生爹养的，印绶给你好了。", "Reward": "610,250,710,0|610,250,710,0|610,250,710,0|610,250,710,0|615,250,715,0|615,250,715,0", "GetItem": "0|0|0|0|1215|1315,6842", "battleLV": "67,67,67,67,67,67" }, { "id": 1042, "type": 1, "BattleName": "桂阳拒婚", "titleindex": 42, "top": 92, "left": 137, "iconid": 4, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,1202,1002", "NpcName": "桂阳先锋,桂阳守卫,桂阳禁卫,桂阳精锐,鲍隆,赵范", "detail": "陈将军和鲍将军连老虎都不怕，哪会怕一个卖草鞋的！|桂阳是我家，安全靠大家，冲啊！|我、我、我是不会怕你的！|打老虎用蛮力，擒刘备还得靠智慧！|桂阳的钱和女人都是我们的，刘备想抢就把他砍了喂老虎！|我家嫂子樊氏，甚是美貌，寡居多年，愿与将军结秦晋之好！", "Reward": "620,250,720,0|620,250,720,0|620,250,720,0|620,250,720,0|625,260,725,0|625,260,725,0", "GetItem": "0|0|0|0|1415|1015,6842", "battleLV": "68,68,68,68,68,68" }, { "id": 1043, "type": 1, "BattleName": "勇夺武陵", "titleindex": 43, "top": 51, "left": 259, "iconid": 3, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,1110,1014", "NpcName": "武陵先锋,武陵守卫,武陵禁卫,武陵精锐,巩志,金旋", "detail": "想不到南蛮之地也有人看上，真是无话可讲！|你点解要打我噶！|别打了，别打了，先听我说,呃…|打也是死，不打也是死，硬着头皮上了！|请饶我一命，末将愿将武陵献于刘皇叔|吾乃名将金日磾之后，尔等岂敢造次！", "Reward": "630,260,730,0|630,260,730,0|630,260,730,0|630,260,730,0|635,260,735,0|635,260,735,0", "GetItem": "0|0|0|0|1115|1215,6842", "battleLV": "69,69,69,69,69,69" }, { "id": 1044, "type": 1, "BattleName": "大战长沙", "titleindex": 44, "top": 116, "left": 330, "iconid": 4, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,3005,1210", "NpcName": "长沙先锋,长沙守卫,长沙禁卫,长沙精锐,魏延,韩玄", "detail": "就算过得了我这一关，也过不了魏将军的孤狼矢！|黄老将军忠义两全，我们跟着他就算死也值了！|长沙郡虽然人才济济，却抵不住一个庸主，罢了罢了！|就算要降，也得让你先见识见识我们的厉害！|打得过我，就帮你一起拿下长沙城！|黄老将军，快快将贼将射于马下！", "Reward": "640,260,740,0|640,260,740,0|640,260,740,0|640,260,740,0|645,260,745,0|645,260,745,0", "GetItem": "0|0|0|0|1315,6842|1415", "battleLV": "70,70,70,70,70,70" }, { "id": 8008, "type": 2, "BattleName": "据守南郡", "titleindex": 8008, "top": 155, "left": 202, "iconid": 103, "time": "0,0,0,0,0,0", "HandIcon": "0,0,0,0,0,0", "NpcName": "山林峰,南郡北路,南郡南路,东门城外,西门城外,三世", "detail": "0|0|0|0|0|0", "Reward": "220,300,850,70|220,300,900,85|220,300,900,85|220,300,900,100|220,300,900,100|380,310,950,105", "GetItem": "7004|7054|7104|7154|7204|6041"}] },
{ "mapname": "争夺合肥", "mapid": 10, "list": [{ "id": 1045, "type": 1, "BattleName": "合淝之围", "titleindex": 45, "top": 70, "left": 25, "iconid": 3, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,1108,3107", "NpcName": "合淝先锋,合淝守卫,合淝禁卫,合淝精锐,刘馥,郭嘉", "detail": "江东贼子又来攻打我军新城了。|天有不测风云，人有旦夕祸福！|贼势汹汹，大事不妙！|想逃就逃吧，你跑出五百步我再追。|想夺合淝，除非我刘某人死了。|区区江东贼子，休想夺我合淝。", "Reward": "650,280,750,0|650,280,750,0|650,280,750,0|655,280,750,0|655,280,755,0|660,280,755,0", "GetItem": "0|0|0|0|1017|1117,6842", "battleLV": "71,71,71,71,71,71" }, { "id": 1046, "type": 1, "BattleName": "先登陷阵", "titleindex": 46, "top": 150, "left": 61, "iconid": 3, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,2352,3105", "NpcName": "先登先锋,先登守卫,先登禁卫,先登精锐,曹洪,张辽", "detail": "这个这个这个……只得以死相拒了！|将士们！无路可退，拼了！|各军振作精神，击破敌军！|众将士！得军师令，将这些毛贼杀个干净！|看你呆头呆脑畏首畏脚，读过几本兵书？|文远在此，还不快快下马受死。", "Reward": "660,280,760,0|660,280,760,0|660,280,760,0|660,280,760,0|665,280,765,0|665,280,765,0", "GetItem": "0|0|0|0|1217|1317,6842", "battleLV": "72,72,72,72,72,72" }, { "id": 1047, "type": 1, "BattleName": "三路兵马", "titleindex": 47, "top": 85, "left": 139, "iconid": 1, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,2405,3208", "NpcName": "东吴先锋,东吴守卫,东吴禁卫,东吴精锐,潘璋,陆逊", "detail": "向前！向前！向前！|看我军歌声雄壮，士气高昂，还不下马投降！|竟敢碍着大爷发财！给我杀！|站住！此乃东吴精锐，怎能擅闯！|我的严阵以待，断不让你再前进一步！|谋定而后动，方为上上之策！", "Reward": "670,280,770,0|670,280,770,0|670,280,770,0|670,280,770,0|675,290,775,0|675,290,775,0", "GetItem": "0|0|0|0|1417|1017,6842", "battleLV": "73,73,73,73,73,73" }, { "id": 1048, "type": 1, "BattleName": "水师东行", "titleindex": 48, "top": 174, "left": 201, "iconid": 2, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,2407,3202", "NpcName": "水师先锋,水师守卫,水师禁卫,水师精锐,鲁肃,吕蒙", "detail": "上天有好生之德，将军何忍生灵涂炭？|长江天险已失，快回去禀告主公，早做准备吧！|众将士！两位公子也带兵迎战了，拼了！|将军威武，何必与我东吴为敌？不如共图大事！|借点粮草不用还，你借了领地也不还总说不过去吧！|今日让你看看我吴下阿蒙的本事！", "Reward": "680,290,780,0|680,290,780,0|680,290,780,0|680,290,780,0|685,290,785,0|685,290,785,0", "GetItem": "0|0|0|0|1117|1217,6842", "battleLV": "74,74,74,74,74,74" }, { "id": 1049, "type": 1, "BattleName": "围攻合淝", "titleindex": 49, "top": 86, "left": 280, "iconid": 3, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,2359,3101", "NpcName": "新城先锋,新城守卫,新城禁卫,新城精锐,满宠,许禇", "detail": "吾乃先锋，够胆就放马过来吧。|经验不是你想买，想买就能买。|想过关，就先让我称称你的斤两吧。|识相的，就在此停步，爷可饶你不死。|我到底该当个文官呢，还是当个武将？|除了典韦大哥，我这辈子没怕过谁。", "Reward": "690,290,790,0|690,290,790,0|690,290,790,0|690,290,790,0|695,290,795,0|695,290,795,0", "GetItem": "0|0|0|0|1317|1417,6842", "battleLV": "75,75,75,75,75,75" }, { "id": 8009, "type": 2, "BattleName": "东吴北上", "titleindex": 8009, "top": 157, "left": 322, "iconid": 104, "time": "0,0,0,0,0,0", "HandIcon": "0,0,0,0,0,0", "NpcName": "整军北上,水路速进,轻骑突袭,猛攻江陵,两军对阵,镇", "detail": "0|0|0|0|0|0", "Reward": "240,310,900,75|240,310,950,90|240,310,950,90|240,310,950,105|240,310,950,105|400,320,1000,110", "GetItem": "7004|7054|7104|7154|7204|6042"}] },
{ "mapname": "血战潼关", "mapid": 11, "list": [{ "id": 1050, "type": 1, "BattleName": "关西起兵", "titleindex": 50, "top": 70, "left": 29, "iconid": 3, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,1109,1107", "NpcName": "关西先锋,关西守卫,关西禁卫,关西精锐,张横,韩遂", "detail": "我西凉骑兵铁蹄一过，寸草不生！|冲啊，为马腾将军报仇雪恨！|我十路大军，已经将尔等重重包围，无路可逃！|兄弟们，马超将军就要来了，杀啊！|偷袭我最擅长，你要小心了哦！|马超只不过是个黄毛小儿，凭什么威望比我还高！", "Reward": "700,310,800,0|700,310,800,0|700,310,800,0|705,310,800,0|705,310,805,0|710,310,805,0", "GetItem": "0|0|0|0|6842|6842", "battleLV": "76,76,76,76,76,76" }, { "id": 1051, "type": 1, "BattleName": "浦阪津", "titleindex": 51, "top": 168, "left": 74, "iconid": 6, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,1215,2305", "NpcName": "浦阪先锋,浦阪守卫,浦阪禁卫,浦阪精锐,马玩,马岱", "detail": "我等奉马将军之命在此设伏，不可掉以轻心。|尔等远道而来，水土不服，何必自寻死路。|虽然胜券在握，也不可掉以轻心！|若依我马将军之计，尔等如何能轻松渡河。|虽然我也姓马，但我跟马超一点关系也没有！|想见我大哥，先吃我两箭再说！", "Reward": "710,310,810,0|710,310,810,0|710,310,810,0|710,310,810,0|715,310,815,0|715,310,815,0", "GetItem": "0|0|0|0|6842|6842", "battleLV": "77,77,77,77,77,77" }, { "id": 1052, "type": 1, "BattleName": "攻守渭南", "titleindex": 52, "top": 81, "left": 143, "iconid": 4, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,3102,3104", "NpcName": "渭南先锋,渭南守卫,渭南禁卫,渭南精锐,徐晃,夏侯渊", "detail": "闲话莫提，先接我这一刀吧。|上头有令，末将等得罪了。|刀口上过日子，不是你死就是我亡。|尔等又为徐将军送军功来耶？|生遇明主，死亦无憾。|全军全速前进，保护丞相。", "Reward": "720,310,820,0|720,310,820,0|720,310,820,0|720,310,820,0|725,320,825,0|725,320,825,0", "GetItem": "0|0|0|0|6842|6842", "battleLV": "78,78,78,78,78,78" }, { "id": 1053, "type": 1, "BattleName": "潼关决战", "titleindex": 53, "top": 142, "left": 240, "iconid": 5, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,3106,3108", "NpcName": "潼关先锋,潼关守卫,潼关禁卫,潼关精锐,张郃,荀彧", "detail": "各军振作精神，击破敌军！|我军占尽地利人和，不日便可破你大军！|儿郎们，取敌人首级者有赏！|潼关内外，已尽为我军所欲，汝等插翅难飞了。|用兵需巧变，列营靠地形，吾张儁乂非一介武夫。|秉忠贞之志，守谦退之节。", "Reward": "730,320,830,0|730,320,830,0|730,320,830,0|730,320,830,0|735,320,835,0|735,320,835,0", "GetItem": "0|0|0|0|6842|6842", "battleLV": "79,79,79,79,79,79" }, { "id": 1054, "type": 1, "BattleName": "败走凉州", "titleindex": 54, "top": 92, "left": 346, "iconid": 4, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,2351,3003", "NpcName": "凉州先锋,凉州守卫,凉州禁卫,凉州精锐,庞德,马超", "detail": "乱臣贼子，人人得而诛之。|将军有令，革杀勿论。|兄弟们看好了，这些反贼一个都不能留。|完了完了，挡不住了。|我要杀你们个片甲不留!|全军突击，休要放走了曹贼！", "Reward": "740,320,840,0|740,320,840,0|740,320,840,0|740,320,840,0|745,320,845,0|745,320,845,0", "GetItem": "0|0|0|0|6842|6842", "battleLV": "80,80,80,80,80,80" }, { "id": 8010, "type": 2, "BattleName": "西凉破裂", "titleindex": 8010, "top": 44, "left": 242, "iconid": 105, "time": "0,0,0,0,0,0", "HandIcon": "0,0,0,0,0,0", "NpcName": "先锋营,虎贲军营,铁骑军营,精锐虎贲,精锐铁骑,骠骑", "detail": "0|0|0|0|0|0", "Reward": "260,320,950,80|260,320,1000,95|260,320,1000,95|260,320,1000,110|260,320,1000,110|420,330,1050,115", "GetItem": "7005|7055|7105|7155|7205|6043"}] },
{ "mapname": "入主西川", "mapid": 12, "list": [{ "id": 1055, "type": 1, "BattleName": "涪水关", "titleindex": 55, "top": 106, "left": 17, "iconid": 5, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,2307,2308", "NpcName": "涪水先锋,涪水守卫,涪水禁卫,涪水精锐,杨怀,高沛", "detail": "待我两路夹攻，叫你首尾不得救应！|且休要动兵，有话好好说。|你千里追击，我以逸待劳！|汝积财吝赏，何以使士卒效命乎！|偷袭我最擅长，你要小心了哦！|十步之内取你…呃…不是你死就是我亡", "Reward": "750,340,850,0|750,340,850,0|750,340,850,0|755,340,850,0|755,340,855,0|760,340,855,0", "GetItem": "0|0|0|0|6842|6842", "battleLV": "81,81,81,81,81,81" }, { "id": 1056, "type": 1, "BattleName": "落凤坡", "titleindex": 56, "top": 83, "left": 90, "iconid": 1, "time": "840,840,840,840,840,840", "HandIcon": "200,200,1015,1007,2032,3008", "NpcName": "雒城先锋,雒城守卫,雒城禁卫,雒城精锐,张任,庞统", "detail": "我等奉马将军之命在此设伏，不可掉以轻心。|尔等远道而来，水土不服，何必自寻死路。|虽然胜券在握，也不可掉以轻心！|骑白马者必是刘备。|万箭齐发，让你无处遁形。|吾道号凤雏，此处名落凤坡，不利于吾，速速退兵。", "Reward": "760,340,860,0|760,340,860,0|760,340,860,0|760,340,860,0|765,340,865,0|765,340,865,0", "GetItem": "0|0|0|0|6842|6842", "battleLV": "82,82,82,82,82,82" }, { "id": 1057, "type": 1, "BattleName": "义释严颜", "titleindex": 57, "top": 32, "left": 159, "iconid": 3, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,2303,2304", "NpcName": "巴郡先锋,巴郡守卫,巴郡禁卫,巴郡精锐,刘巴,严颜", "detail": "闲话莫提，先接我这一刀吧。|上头有令，末将等得罪了。|刀口上过日子，不是你死就是我亡。|我等深感主公厚恩，虽万死亦不能报也。|好女不嫁二夫，忠臣不事二主。|我老头子今天要叫你好看。", "Reward": "770,340,870,0|770,340,870,0|770,340,870,0|770,340,870,0|775,350,875,0|775,350,875,0", "GetItem": "0|0|0|0|6842|6842", "battleLV": "83,83,83,83,83,83" }, { "id": 1058, "type": 1, "BattleName": "大战葭萌", "titleindex": 58, "top": 38, "left": 259, "iconid": 3, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,2305,3003", "NpcName": "葭萌先锋,葭萌守卫,葭萌禁卫,葭萌精锐,马岱,马超", "detail": "各军振作精神，击破敌军！|我军占尽地利人和，不日便可破你大军！|儿郎们，取敌人首级者有赏！|你从哪里来，要到哪里去？|刘皇叔当世明主，不如降之。|要我降你，得先看看你的本事。", "Reward": "780,350,880,0|780,350,880,0|780,350,880,0|780,350,880,0|785,350,885,0|785,350,885,0", "GetItem": "0|0|0|0|6842|6842", "battleLV": "84,84,84,84,84,84" }, { "id": 1059, "type": 1, "BattleName": "天府之国", "titleindex": 59, "top": 113, "left": 340, "iconid": 4, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,1002,2035", "NpcName": "成都先锋,成都守卫,成都禁卫,成都精锐,黄权,刘璋", "detail": "乱臣贼子，人人得而诛之。|将军有令，革杀勿论。|兄弟们看好了，这些反贼一个都不能留。|完了完了，挡不住了。|入得西川，就得了半壁江山。|吾之不明，悔之何及！不若开门投降，以救满城百姓。", "Reward": "790,350,890,0|790,350,890,0|790,350,890,0|790,350,890,0|795,350,895,0|795,350,895,0", "GetItem": "0|0|0|0|6842|6842", "battleLV": "85,85,85,85,85,85" }, { "id": 8011, "type": 2, "BattleName": "金雁孤魂", "titleindex": 8011, "top": 139, "left": 195, "iconid": 102, "time": "0,0,0,0,0,0", "HandIcon": "0,0,0,0,0,0", "NpcName": "金雁谷,山崖北,日月潭,望月坡,天崖路,金雁勇士", "detail": "0|0|0|0|0|0", "Reward": "280,330,1000,85|280,330,1050,100|280,330,1050,100|280,330,1050,115|280,330,1050,115|440,340,1100,120", "GetItem": "7005|7055|7105|7155|7205|6044"}] },
{ "mapname": "汉中之战", "mapid": 13, "list": [{ "id": 1060, "type": 1, "BattleName": "攻巴东郡", "titleindex": 60, "top": 104, "left": 26, "iconid": 3, "time": "840,840,840,840,840,840", "HandIcon": "200,200,1015,203,1009,3106", "NpcName": "瓦口先锋,瓦口守卫,瓦口禁卫,瓦口精锐,戴陵,张郃", "detail": "将军有令，禁闭城门，坚守不出。|张郃不让俺们出去喝酒，这山后小道正好派上用场。|我瓦口隘如铜墙铁壁，就算张飞也飞不进来！|咦，你怎么在我背后，从哪里钻出来的。|关后四五路火起，不知何处兵来。|人要倒了霉，喝凉水都塞牙。", "Reward": "800,370,900,0|800,370,900,0|800,370,900,0|805,370,900,0|805,370,905,0|810,370,905,0", "GetItem": "0|0|0|0|6842|6842", "battleLV": "86,86,86,86,86,86" }, { "id": 1061, "type": 1, "BattleName": "阳平关", "titleindex": 61, "top": 97, "left": 112, "iconid": 5, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,1002,1007", "NpcName": "天荡先锋,天荡守卫,天荡禁卫,天荡精锐,韩浩,夏侯尚", "detail": "我等奉将军之命在此设伏，不可掉以轻心。|尔等远道而来，水土不服，何必自寻死路。|虽然胜券在握，也不可掉以轻心！|不可轻敌，且宜坚守！|天荡山乃粮草之所，绝不能丢。|不入虎穴，焉得虎子。这次我成了虎子。", "Reward": "810,370,910,0|810,370,910,0|810,370,910,0|810,370,910,0|815,370,915,0|815,370,915,0", "GetItem": "0|0|0|0|6842|6842", "battleLV": "87,87,87,87,87,87" }, { "id": 1062, "type": 1, "BattleName": "火烧鹿角", "titleindex": 62, "top": 87, "left": 200, "iconid": 1, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,1015,3104", "NpcName": "定军先锋,定军守卫,定军禁卫,定军精锐,夏侯德,夏侯渊", "detail": "闲话莫提，先接我这一刀吧。|上头有令，末将等得罪了。|刀口上过日子，不是你死就是我亡。|若不回头，小命难保。|尔等远涉而来，连日疲困，更兼深入战境，此无谋也。|夏侯妙才受丞相重托担任东川防守重责,不敢怠慢，得罪了。", "Reward": "820,370,920,0|820,370,920,0|820,370,920,0|820,370,920,0|825,380,925,0|825,380,925,0", "GetItem": "0|0|0|0|6842|6842", "battleLV": "88,88,88,88,88,88" }, { "id": 1063, "type": 1, "BattleName": "攻武都郡", "titleindex": 63, "top": 134, "left": 283, "iconid": 3, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,1000,3102", "NpcName": "汉水先锋,汉水守卫,汉水禁卫,汉水精锐,王平,徐晃", "detail": "各军振作精神，击破敌军！|我军占尽地利人和，不日便可破你大军！|儿郎们，取敌人首级者有赏！|韩信点兵，多多益善，我要努力成为那样的将军。|大军若渡水，倘要急退，如之奈何？|背水一战，绝处逢生。", "Reward": "830,380,930,0|830,380,930,0|830,380,930,0|830,380,930,0|835,380,935,0|835,380,935,0", "GetItem": "0|0|0|0|6842|6843", "battleLV": "89,89,89,89,89,89" }, { "id": 1064, "type": 1, "BattleName": "占领汉中", "titleindex": 64, "top": 79, "left": 347, "iconid": 4, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,1212,1111", "NpcName": "斜谷先锋,斜谷守卫,斜谷禁卫,斜谷精锐,杨修,曹彰", "detail": "乱臣贼子，人人得而诛之。|将军有令，格杀勿论。|兄弟们看好了，这些反贼一个都不能留。|完了完了，挡不住了。|鸡肋，鸡肋。|大丈夫当学卫青、霍去病，立功沙漠，驱十万众，纵横天下。", "Reward": "840,380,940,0|840,380,940,0|840,380,940,0|840,380,940,0|845,380,945,0|845,380,945,0", "GetItem": "0|0|0|0|6842|6842", "battleLV": "90,90,90,90,90,90" }, { "id": 8012, "type": 2, "BattleName": "汉中立王", "titleindex": 8012, "top": 172, "left": 142, "iconid": 103, "time": "0,0,0,0,0,0", "HandIcon": "0,0,0,0,0,0", "NpcName": "先锋营,雪林峡谷,巴蜀外境,益州北方,三辅地区,季汉", "detail": "0|0|0|0|0|0", "Reward": "300,340,1050,90|300,340,1100,105|300,340,1100,105|300,340,1100,120|300,340,1100,120|460,350,1150,125", "GetItem": "7006|7056|7106|7156|7206|6045"}] },
{ "mapname": "襄樊之战", "mapid": 14, "list": [{ "id": 1065, "type": 1, "BattleName": "樊城之围", "titleindex": 65, "top": 94, "left": 32, "iconid": 3, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,2359,2350", "NpcName": "樊城先锋,樊城守卫,樊城禁卫,樊城精锐,满宠,曹仁", "detail": "临兵斗者皆阵列在前,出击！|兵者，诡道也。|兵来将挡，水来土埋。|兄弟们，援兵就要来了，杀啊！|我到底是文官，还是武将？|尽管来吧！", "Reward": "850,400,950,0|850,400,950,0|850,400,950,0|855,400,950,0|855,400,955,0|860,400,955,0", "GetItem": "0|0|0|0|6842|6843", "battleLV": "91,91,91,91,91,91" }, { "id": 1066, "type": 1, "BattleName": "水淹七军", "titleindex": 66, "top": 155, "left": 102, "iconid": 1, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,2351,2354", "NpcName": "襄江先锋,襄江守卫,襄江禁卫,襄江精锐,庞德,于禁", "detail": "我等奉将军之命在此设伏，不可掉以轻心。|尔等远道而来，水土不服，何必自寻死路。|虽然胜券在握，也不可掉以轻心！|若依我之计，尔等如何能轻松渡河。|吾受魏王厚恩，誓以死报。|上命差遣，身不由己。望君侯怜悯，誓以死报。", "Reward": "860,400,960,0|860,400,960,0|860,400,960,0|860,400,960,0|865,400,965,0|865,400,965,0", "GetItem": "0|0|0|0|6842|6842", "battleLV": "92,92,92,92,92,92" }, { "id": 1067, "type": 1, "BattleName": "刮骨疗毒", "titleindex": 67, "top": 162, "left": 213, "iconid": 3, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,1208,2033", "NpcName": "荆州先锋,荆州守卫,荆州禁卫,荆州精锐,马良,华佗", "detail": "不可轻敌，且宜坚守！|关将军正在帐内疗毒，闲散人等不得打扰。|刮骨疗毒，古今未有，将军真神人也。|君子弃瑕以拔才,壮士断腕以全质。|五行相克，金克木，木克土，土克水，水克火，火克金。|早睡早起，方能养生。", "Reward": "870,400,970,0|870,400,970,0|870,400,970,0|870,400,970,0|875,410,975,0|875,410,975,0", "GetItem": "0|0|0|0|6842|6842", "battleLV": "93,93,93,93,93,93" }, { "id": 1068, "type": 1, "BattleName": "白衣渡江", "titleindex": 68, "top": 50, "left": 239, "iconid": 1, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,2404,3202", "NpcName": "东吴斥候,东吴先锋,东吴勇士,东吴精锐,朱然,吕蒙", "detail": "且慢动手，我们都是客商！|用兵需巧变，列营靠地形。|这次真是大雾帮了忙了。|出其不意，攻其不备。|利而诱之，乱而取之。|运筹帷幄之中，决胜千里之外。", "Reward": "880,410,980,0|880,410,980,0|880,410,980,0|880,410,980,0|885,410,985,0|885,410,985,0", "GetItem": "0|0|0|0|6842|6843", "battleLV": "94,94,94,94,94,94" }, { "id": 1069, "type": 1, "BattleName": "败走麦城", "titleindex": 69, "top": 126, "left": 339, "iconid": 4, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,2300,3000", "NpcName": "麦城先锋,麦城守卫,麦城禁卫,麦城勇士,关平,关羽", "detail": "列好阵形，保护将军。|我们的援兵就要来了，到时候给你好看。|生遇明主，死亦无憾。|完了完了，挡不住了。|兵临城下，无计可施。|什么？这里叫麦城？", "Reward": "890,410,990,0|890,410,990,0|890,410,990,0|890,410,990,0|895,410,995,0|895,410,995,0", "GetItem": "0|0|0|0|6842|6843", "battleLV": "95,95,95,95,95,95" }, { "id": 8013, "type": 2, "BattleName": "以逸待劳", "titleindex": 8013, "top": 52, "left": 120, "iconid": 101, "time": "0,0,0,0,0,0", "HandIcon": "0,0,0,0,0,0", "NpcName": "出荆州,占据襄阳,占据樊城,水淹七军,威震华夏,忠勇", "detail": "0|0|0|0|0|0", "Reward": "320,350,1250,100|320,350,1300,115|320,350,1300,115|320,350,1300,130|320,350,1300,130|480,380,1450,140", "GetItem": "7006|7056|7106|7156|7206|6046"}] },
{ "mapname": "夷陵之战", "mapid": 15, "list": [{ "id": 1070, "type": 1, "BattleName": "兵出秭归", "titleindex": 70, "top": 144, "left": 23, "iconid": 3, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,1104,2404", "NpcName": "秭归先锋,秭归守卫,秭归禁卫,秭归精锐,孙桓,朱然", "detail": "你是哪里来的狂徒，敢犯我东吴地界。|慢慢长江之上，你哪里是我东吴水兵的对手。|打不死你也淹死你。|养精蓄锐，伸足擦腿，准备显身手。|天将降大任于斯人也,必先苦其心志,劳其筋骨,饿其体肤。|我家主公只求保境安民，汝等何故来犯。", "Reward": "900,430,1000,0|900,430,1000,0|900,430,1000,0|905,430,1000,0|905,430,1005,0|910,430,1005,0", "GetItem": "0|0|0|0|6842|6842", "battleLV": "96,96,96,96,96,96" }, { "id": 1071, "type": 1, "BattleName": "威震彝陵", "titleindex": 71, "top": 96, "left": 86, "iconid": 1, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,2402,3206", "NpcName": "彝陵先锋,彝陵守卫,彝陵禁卫,彝陵精锐,韩当,周泰", "detail": "冷了吧，想烤火吧，想吃肉吧，降了就全有了。|开弓放箭，杀一杀敌军的锐气。|降了吧！乡里乡亲的不要伤了和气。|就凭你等蟊贼，竟破了我前锋，必是用了什么鬼蜮伎俩。|与我东吴为敌者，杀无赦！|东吴久无战事，今日终于可以立功了。", "Reward": "910,430,1010,0|910,430,1010,0|910,430,1010,0|910,430,1010,0|915,430,1015,0|915,430,1015,0", "GetItem": "0|0|0|0|6842|6842", "battleLV": "97,97,97,97,97,97" }, { "id": 1072, "type": 1, "BattleName": "猇亭鏖战", "titleindex": 72, "top": 146, "left": 170, "iconid": 3, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,2405,3200", "NpcName": "猇亭先锋,猇亭守卫,猇亭禁卫,猇亭精锐,潘璋,甘宁", "detail": "我家将军是甘宁甘兴霸，擒你就像探囊取物。|看你也是个好汉，不如跟随我家甘将军。|待我守住猇亭，你就寸步难行。|我家主公深得民心，岂是尔等蟊贼可以撼动。|我这里处处伏兵，胜似龙潭虎穴，你可敢闯。|要不是吃坏了肚子，岂容尔等在这里撒野。", "Reward": "920,430,1020,0|920,430,1020,0|920,430,1020,0|920,430,1020,0|925,440,1025,0|925,440,1025,0", "GetItem": "0|0|0|0|6842|6843", "battleLV": "98,98,98,98,98,98" }, { "id": 1073, "type": 1, "BattleName": "火烧连营", "titleindex": 73, "top": 165, "left": 271, "iconid": 1, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,2301,2302", "NpcName": "蜀汉斥候,蜀汉先锋,蜀汉勇士,蜀汉精锐,关兴,张苞", "detail": "长驱直入，誓灭东吴。|听口音你不是本地人吧，可听过我蜀汉先锋的厉害。|着火了，着火了，快跑啊！|人为刀俎，我为鱼肉，拼了。|关家子弟兵，速速前来护驾。|众将士奋力向前，斩杀孙权，斩杀陆逊！", "Reward": "930,440,1030,0|930,440,1030,0|930,440,1030,0|930,440,1030,0|935,440,1035,0|935,440,1035,0", "GetItem": "0|0|0|0|6842|6842", "battleLV": "99,99,99,99,99,99" }, { "id": 1074, "type": 1, "BattleName": "八阵退敌", "titleindex": 74, "top": 83, "left": 336, "iconid": 4, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,2033,3208", "NpcName": "东吴先锋,东吴守卫,东吴禁卫,东吴勇士,黄承彦,陆逊", "detail": "吱吱吱吱！~~~|呜呜呜~呜~！！！|哄吼~~！哈嘿~~@~~！~|喔哈哈哈~~~~嚄嚄嚄！|老夫平生好善，不忍将军陷没于此八阵图中，请将军速速退兵|此阵每时每刻变化无穷，孔明真卧龙也，吾不能及，速速退兵！", "Reward": "940,440,1040,0|940,440,1040,0|940,440,1040,0|940,440,1040,0|945,440,1045,0|945,440,1045,0", "GetItem": "0|0|0|0|6842|6843", "battleLV": "100,100,100,100,100,100" }, { "id": 8014, "type": 2, "BattleName": "富池口", "titleindex": 8014, "top": 47, "left": 201, "iconid": 102, "time": "0,0,0,0,0,0", "HandIcon": "0,0,0,0,0,0", "NpcName": "夷陵山,北山峰,南山峰,富池北路,富池南路,五溪蛮王", "detail": "0|0|0|0|0|0", "Reward": "320,360,1250,105|320,360,1300,120|320,360,1300,120|320,360,1300,135|320,360,1300,135|480,400,1450,145", "GetItem": "7007|7057|7107|7157|7207|6047"}] },
{ "mapname": "平定南蛮", "mapid": 16, "list": [{ "id": 1075, "type": 1, "BattleName": "五月渡泸", "titleindex": 75, "top": 169, "left": 41, "iconid": 2, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,2303,2356", "NpcName": "泸水先锋,泸水守卫,泸水禁卫,泸水精锐,董荼那,金环", "detail": "你看你看，有一群汉人前来送死了。|你们汉人，吹牛可以，打架的不行。|看我把你们赶到江里面喂鱼。|什么？你怎么过来了，一定是幻觉。|我乃第二洞大元帅董吐奶是也，不许笑，不许笑。|孩儿们，准备好一口大锅，待我抓这娃娃回来下酒。", "Reward": "950,460,1050,0|950,460,1050,0|950,460,1050,0|955,460,1050,0|955,460,1055,0|960,460,1055,0", "GetItem": "0|0|0|0|6842|6842", "battleLV": "101,101,101,101,101,101" }, { "id": 1076, "type": 1, "BattleName": "大破秃龙", "titleindex": 76, "top": 71, "left": 87, "iconid": 1, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,2029,2040", "NpcName": "秃龙先锋,秃龙守卫,秃龙禁卫,秃龙精锐,孟优,朵思大王", "detail": "你们汉人各个身体娇弱，何必来南中受死。|毒雾瘴气吸过了没，吸过再来和我打|看看你身后这些窝囊兵，到了这烟瘴之地，一个都回不去。|毒泉毒水喝了吗？喝过再来找我。|老哥要我抓你回去。我老哥是谁？没看我姓孟吗？|将军渴了吧，可到我那四眼毒泉…啊不…甘泉去饮水。", "Reward": "960,460,1060,0|960,460,1060,0|960,460,1060,0|960,460,1060,0|965,460,1065,0|965,460,1065,0", "GetItem": "0|0|0|0|6842|6842", "battleLV": "102,102,102,102,102,102" }, { "id": 1077, "type": 1, "BattleName": "火神祝融", "titleindex": 77, "top": 139, "left": 160, "iconid": 3, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,2408,3305", "NpcName": "银坑先锋,银坑守卫,银坑禁卫,银坑精锐,带来洞主,祝", "detail": "汉人，我们夫人亲自率军拿你，这是你的荣幸。|夫人在后头看着哪，弟兄们冲啊！|保护祝融夫人，丢了夫人大家都没得混了。|我等是祝融夫人亲兵，正好抓你去献殷勤！|我就是给姐姐姐夫出出主意，何罪之有？|你敢打我男人，先问问姑奶奶我手中的彪同不同意。", "Reward": "970,460,1070,0|970,460,1070,0|970,460,1070,0|970,460,1070,0|975,470,1075,0|975,470,1075,0", "GetItem": "0|0|0|0|6842|6843", "battleLV": "103,103,103,103,103,103" }, { "id": 1078, "type": 1, "BattleName": "驱虎吞狼", "titleindex": 78, "top": 161, "left": 253, "iconid": 1, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,2031,2043", "NpcName": "八纳斥候,八纳先锋,八纳勇士,八纳精锐,阿哙喃,木鹿", "detail": "胆敢跑到我南中来，是闲我家大王的猛兽吃不饱吗？|到了我八纳洞，就别想囫囵个出去。|我们洞主木鹿大王，能呼风唤雨，出入有虎豹豺狼相伴。|我大王手下有三万兽兵，你等凡人如何胜得。|我堂堂第三洞元帅，竟要亲自杀你，真是麻烦。|小子，见过大象和猛虎么，吓的尿裤子了吧？", "Reward": "980,470,1080,0|980,470,1080,0|980,470,1080,0|980,470,1080,0|985,470,1085,0|985,470,1085,0", "GetItem": "0|0|0|0|6842|6842", "battleLV": "104,104,104,104,104,104" }, { "id": 1079, "type": 1, "BattleName": "火烧藤甲", "titleindex": 79, "top": 132, "left": 347, "iconid": 6, "time": "840,840,840,840,840,840", "HandIcon": "203,200,1015,1007,4005,3306", "NpcName": "乌戈先锋,乌戈守卫,乌戈禁卫,乌戈勇士,兀突骨,孟获", "detail": "我有藤甲护身，刀枪不入。|前轱辘不转后轱辘转思密达！|前面那位是说我藤甲军战无不胜，攻无不克，劝你早早投降。|汉人，给我送午饭来了，好白净的肉啊！|天干物燥，小心火烛。|不服就是不服，你再抓我七次我也不服！", "Reward": "990,470,1090,0|990,470,1090,0|990,470,1090,0|990,470,1090,0|995,470,1095,0|995,470,1095,0", "GetItem": "0|0|0|0|6842|6843", "battleLV": "105,105,105,105,105,105" }, { "id": 8015, "type": 2, "BattleName": "七擒孟获", "titleindex": 8015, "top": 48, "left": 232, "iconid": 107, "time": "0,0,0,0,0,0", "HandIcon": "0,0,0,0,0,0", "NpcName": "乌戈国主,三洞元帅,银坑洞主,火神后裔,八呐蛮王,南", "detail": "0|0|0|0|0|0", "Reward": "340,380,1300,110|340,380,1350,125|340,380,1350,125|340,380,1350,140|340,380,1350,140|500,420,1500,150", "GetItem": "7007|7057|7107|7157|7207|6048"}] },
{ "mapname": "陆逊北伐", "mapid": 17, "list": [{ "id": 1080, "type": 1, "BattleName": "假城破曹", "titleindex": 80, "top": 106, "left": 21, "iconid": 3, "time": "840,840,840,840,840,840", "HandIcon": "200,201,1104,203,1001,1203", "NpcName": "北伐先锋,北伐守卫,北伐禁卫,北伐精锐,贾逵,周鲂", "detail": "重兵伐魏，屠尽曹氏！|吾皇应天而登基，乃真命天子也！|吾皇亲征，汝等还不速速退散！|生遇明主，死亦无憾。|吾乃伯言帐下贾逵是也！|诱敌深入，方能一击必杀！", "Reward": "1000,500,1100,0|1000,500,1100,0|1000,500,1100,0|1000,500,1100,0|1010,500,1110,0|1010,500,1110,0", "GetItem": "0|0|0|0|0|6842", "battleLV": "106,106,106,106,106,106" }, { "id": 1081, "type": 1, "BattleName": "石亭之战", "titleindex": 81, "top": 143, "left": 95, "iconid": 3, "time": "840,840,840,840,840,840", "HandIcon": "203,201,1004,1104,2401,1015", "NpcName": "石亭先锋,石亭守卫,石亭禁卫,石亭精锐,朱桓,全琮", "detail": "吾乃先锋，够胆就放马过来吧。|我的严阵以待，断不让你在前进一步！|想逃就逃吧，你跑出五百步我再追。|众将士！得军师令，将这些毛贼杀个干净！|声东而击西，伯言之计妙也！|虽然胜券在握，也不可掉以轻心！", "Reward": "1020,510,1120,0|1020,510,1120,0|1020,510,1120,0|1020,510,1120,0|1030,510,1130,0|1030,510,1130,0", "GetItem": "0|0|0|0|0|6842", "battleLV": "107,107,107,107,107,107" }, { "id": 1082, "type": 1, "BattleName": "襄阳退敌", "titleindex": 82, "top": 166, "left": 191, "iconid": 4, "time": "840,840,840,840,840,840", "HandIcon": "200,201,1012,1203,1105,4001", "NpcName": "襄阳先锋,襄阳守卫,襄阳禁卫,襄阳精锐,周峻,诸葛瑾", "detail": "利而诱之，乱而取之。|临兵斗者皆阵列在前,出击！|兵者，诡道也。|兵来将挡，水来土埋。|伯言将军算无遗策，吾等佩服。|非道不行，非义不言！", "Reward": "1040,520,1140,0|1040,520,1140,0|1040,520,1140,0|1040,520,1140,0|1050,520,1150,0|1050,520,1150,0", "GetItem": "0|0|0|0|0|6842", "battleLV": "108,108,108,108,108,108" }, { "id": 1083, "type": 1, "BattleName": "诈攻庐江", "titleindex": 83, "top": 153, "left": 285, "iconid": 1, "time": "840,840,840,840,840,840", "HandIcon": "1004,1008,1006,203,1104,2359", "NpcName": "庐江先锋,庐江守卫,庐江禁卫,庐江精锐,王淩,满宠", "detail": "又来一个，吃我一刀。|兄弟们看好了，这些反贼一个都不能留。|既然来了，就别想走了！|大家上啊，保护将军。|大业未成，我不甘啊！|料敌如神，不输孔明。", "Reward": "1060,530,1160,0|1060,530,1160,0|1060,530,1160,0|1060,530,1160,0|1070,530,1170,0|1070,530,1170,0", "GetItem": "0|0|0|0|0|6842", "battleLV": "109,109,109,109,109,109" }, { "id": 1084, "type": 1, "BattleName": "屯兵邾城", "titleindex": 84, "top": 86, "left": 342, "iconid": 3, "time": "840,840,840,840,840,840", "HandIcon": "203,201,1004,1103,1212,1015", "NpcName": "邾城先锋,邾城守卫,邾城禁卫,邾城精锐,张梁,周峻", "detail": "看来尔也算是有点本事了。|能到此，也算你功德圆满了。|善哉、善哉，回头是岸啊。|大胆狂徒，敢打扰本将军休息。|吾皇伐魏，吾等甘为先锋！|甘为伯言将军赴死！", "Reward": "1080,540,1180,0|1080,540,1180,0|1080,540,1180,0|1080,540,1180,0|1090,540,1190,0|1090,540,1190,0", "GetItem": "0|0|0|0|0|6842", "battleLV": "110,110,110,110,110,110" }, { "id": 8016, "type": 2, "BattleName": "濡须口", "titleindex": 8016, "top": 51, "left": 181, "iconid": 108, "time": "0,0,0,0,0,0", "HandIcon": "0,0,0,0,0,0", "NpcName": "石阳诱降,计诈江夏,鄱阳平乱,镇压庐陵,起义鄱阳,平", "detail": "0|0|0|0|0|0", "Reward": "340,400,1350,120|340,400,1400,135|340,400,1400,135|340,400,1400,150|340,400,1400,150|500,440,1550,160", "GetItem": "7008|7058|7108|7158|7208|6049"}] },
{ "mapname": "六出祁山", "mapid": 18, "list": [{ "id": 1085, "type": 1, "BattleName": "声东击西", "titleindex": 85, "top": 183, "left": 41, "iconid": 2, "time": "840,840,840,840,840,840", "HandIcon": "200,203,201,1012,4013,3006", "NpcName": "伐魏先锋,伐魏守卫,伐魏禁卫,伐魏精锐,马谡,姜维", "detail": "孔明六出祁山前，愿以只手将天补。|何期历数到此终，长星半夜落山坞！|讨伐曹魏，一统汉室~|伯约将军乃武侯门生，汝等速速来降！|秦岭之西，有一条路，地名街亭，此为汉中之咽喉！|忠勤时事，思虑精密，考其所有，永南、季常诸人不如也。", "Reward": "1100,550,1200,0|1100,550,1200,0|1100,550,1200,0|1100,550,1200,0|1110,550,1210,0|1110,550,1210,0", "GetItem": "0|0|0|0|0|6843", "battleLV": "111,111,111,111,111,111" }, { "id": 1086, "type": 1, "BattleName": "围攻陈仓", "titleindex": 86, "top": 133, "left": 101, "iconid": 3, "time": "840,840,840,840,840,840", "HandIcon": "203,1007,201,1012,1115,3005", "NpcName": "陈仓先锋,陈仓守卫,陈仓禁卫,陈仓精锐,王双,魏延", "detail": "武侯所指，吾等拼死所向~！|养精蓄锐，伸足擦腿，准备显身手。|尔等远道而来，水土不服，何必自寻死路。|又来一个，吃我一刀。|百发百中，有万夫不当之勇！|谁敢杀我！！！", "Reward": "1120,560,1220,0|1120,560,1220,0|1120,560,1220,0|1120,560,1220,0|1130,560,1230,0|1130,560,1230,0", "GetItem": "0|0|0|0|0|6843", "battleLV": "112,112,112,112,112,112" }, { "id": 1087, "type": 1, "BattleName": "武都之战", "titleindex": 87, "top": 86, "left": 180, "iconid": 5, "time": "840,840,840,840,840,840", "HandIcon": "200,201,1004,1103,1015,1215", "NpcName": "武都先锋,武都守卫,武都禁卫,武都精锐,郭淮,陈式", "detail": "人为刀俎，我为鱼肉，拼了。|混帐！你们这群蠢材，敌人都到家门口了，给我上。|待我两路夹攻，叫你首尾不得救应！|降了吧！乡里乡亲的不要伤了和气。|姜维独凭气力高，九伐中原空劬劳。|败军之将，丞相杀我，我无悔矣。", "Reward": "1140,570,1240,0|1140,570,1240,0|1140,570,1240,0|1140,570,1240,0|1150,570,1250,0|1150,570,1250,0", "GetItem": "0|0|0|0|0|6842", "battleLV": "113,113,113,113,113,113" }, { "id": 1088, "type": 1, "BattleName": "据守祁山", "titleindex": 88, "top": 160, "left": 277, "iconid": 2, "time": "840,840,840,840,840,840", "HandIcon": "206,203,201,1005,1103,3106", "NpcName": "祁山先锋,祁山守卫,祁山禁卫,祁山精锐,李严,张郃", "detail": "不可轻敌，且宜坚守！|众将士小心应战，不要中了埋伏啊！|各军振作精神，击破敌军！|要不是吃坏了肚子，岂容尔等在这里撒野。|览其举措，迹其规矩，招祸取咎，无不自己也。|用兵需巧变，列营靠地形，吾张儁乂非一介武夫。", "Reward": "1160,580,1260,0|1160,580,1260,0|1160,580,1260,0|1160,580,1260,0|1170,580,1270,0|1170,580,1270,0", "GetItem": "0|0|0|0|0|6843", "battleLV": "114,114,114,114,114,114" }, { "id": 1089, "type": 1, "BattleName": "屯田渭水", "titleindex": 89, "top": 127, "left": 336, "iconid": 4, "time": "840,840,840,840,840,840", "HandIcon": "202,200,201,1010,2305,1210", "NpcName": "渭水斥候,渭水守卫,渭水禁卫,渭水精锐,马岱,杨仪", "detail": "尔等远道而来，水土不服，何必自寻死路。|既然来了，就别想走了！|大家上啊，保护将军。|混帐！你们这群蠢材，敌人都到家门口了，给我上。|军师妙计，果然一一映现。|庸奴！复能作恶不？", "Reward": "1180,590,1280,0|1180,590,1280,0|1180,590,1280,0|1180,590,1280,0|1190,590,1290,0|1190,590,1290,0", "GetItem": "0|0|0|0|0|6842", "battleLV": "115,115,115,115,115,115" }, { "id": 8017, "type": 2, "BattleName": "失守街亭", "titleindex": 8017, "top": 165, "left": 173, "iconid": 102, "time": "0,0,0,0,0,0", "HandIcon": "0,0,0,0,0,0", "NpcName": "誓师汉中,进军祁山,佯攻斜谷,横穿秦岭,威震关中,失", "detail": "0|0|0|0|0|0", "Reward": "360,420,1400,130|360,420,1450,155|360,420,1450,155|360,420,1450,160|360,420,1450,160|550,460,1600,170", "GetItem": "7008|7058|7108|7158|7208|6050"}] },
{ "mapname": "九伐中原", "mapid": 19, "list": [{ "id": 1090, "type": 1, "BattleName": "相持南安", "titleindex": 90, "top": 48, "left": 29, "iconid": 3, "time": "840,840,840,840,840,840", "HandIcon": "202,200,201,1103,4012,2308", "NpcName": "南安先锋,南安守卫,南安禁卫,南安精锐,廖化,蒋琬", "detail": "我家主公只求保境安民，汝等何故来犯。|列好阵形，保护将军。|我们的援兵就要来了，到时候给你好看。|生遇明主，死亦无憾。|蜀中无大将，吾愿为先锋！|讬志忠雅，当与吾共赞王业者也。", "Reward": "1200,600,1300,0|1200,600,1300,0|1200,600,1300,0|1200,600,1300,0|1210,600,1310,0|1210,600,1310,0", "GetItem": "0|0|0|0|0|6842", "battleLV": "116,116,116,116,116,116" }, { "id": 1091, "type": 1, "BattleName": "关门打狗", "titleindex": 91, "top": 115, "left": 95, "iconid": 2, "time": "840,840,840,840,840,840", "HandIcon": "203,1112,201,1005,1115,1211", "NpcName": "汉中先锋,汉中守卫,汉中禁卫,汉中精锐,王平,费祎", "detail": "众将士小心应战，不要中了埋伏啊！|又来一个，吃我一刀。|既然来了，就别想走了！|大家上啊，保护将军。|号为飞军，所向无前~！|君天下淑德，必当股肱蜀朝。", "Reward": "1220,610,1320,0|1220,610,1320,0|1220,610,1320,0|1220,610,1320,0|1230,610,1330,0|1230,610,1330,0", "GetItem": "0|0|0|0|0|6843", "battleLV": "117,117,117,117,117,117" }, { "id": 1092, "type": 1, "BattleName": "大战洮西", "titleindex": 92, "top": 45, "left": 164, "iconid": 5, "time": "840,840,840,840,840,840", "HandIcon": "202,1103,1004,1104,1015,4011", "NpcName": "洮西先锋,洮西守卫,洮西禁卫,洮西精锐,郭淮,夏侯霸", "detail": "看来尔也算是有点本事了。|能到此，也算你功德圆满了。|善哉、善哉，回头是岸啊。|大胆狂徒，敢打扰本将军休息。|比岁以来，摧破廖化，禽虏句安，功绩显著。|可怜投汉夏侯霸，顷刻城边箭下亡。", "Reward": "1240,620,1340,0|1240,620,1340,0|1240,620,1340,0|1240,620,1340,0|1250,620,1350,0|1250,620,1350,0", "GetItem": "0|0|0|0|0|6842", "battleLV": "118,118,118,118,118,118" }, { "id": 1093, "type": 1, "BattleName": "陇西狄道", "titleindex": 93, "top": 109, "left": 249, "iconid": 1, "time": "840,840,840,840,840,840", "HandIcon": "206,203,1004,1005,1012,1004", "NpcName": "陇西先锋,陇西守卫,陇西禁卫,陇西精锐,王经,陈泰", "detail": "尔等远道而来，水土不服，何必自寻死路。|咦，你怎么在我背后，从哪里钻出来的。|我家主公深得民心，岂是尔等蟊贼可以撼动。|又来一个，吃我一刀。|“人谁不死，正恐不得其所”以此并命，何恨之有！|征西沉勇能断，荷方伯之重，救将陷之城，而不求益兵。", "Reward": "1260,630,1360,0|1260,630,1360,0|1260,630,1360,0|1260,630,1360,0|1270,630,1370,0|1270,630,1370,0", "GetItem": "0|0|0|0|0|6842", "battleLV": "119,119,119,119,119,119" }, { "id": 1094, "type": 1, "BattleName": "终战侯和", "titleindex": 94, "top": 148, "left": 335, "iconid": 3, "time": "840,840,840,840,840,840", "HandIcon": "1115,203,1012,1007,1211,1113", "NpcName": "侯和先锋,侯和守卫,侯和禁卫,侯和精锐,诸葛绪,邓艾", "detail": "虽然胜券在握，也不可掉以轻心！|临兵斗者皆阵列在前,出击！|兵者，诡道也。|兵来将挡，水来土埋。|钟会邓艾分兵进，汉室江山尽属曹。|筹画有方，忠勇奋发，斩将十数，馘首千计。", "Reward": "1280,640,1380,0|1280,640,1380,0|1280,640,1380,0|1280,640,1380,0|1290,640,1390,0|1290,640,1390,0", "GetItem": "0|0|0|0|0|6843", "battleLV": "120,120,120,120,120,120" }, { "id": 8018, "type": 2, "BattleName": "初建基业", "titleindex": 8018, "top": 159, "left": 166, "iconid": 100, "time": "0,0,0,0,0,0", "HandIcon": "0,0,0,0,0,0", "NpcName": "出兵石营,行军董亭,进围襄武,洛门解围,大破河关,初", "detail": "0|0|0|0|0|0", "Reward": "380,440,1450,140|380,440,1500,165|380,440,1500,165|380,440,1500,170|380,440,1500,170|570,480,1650,180", "GetItem": "7600|7601|7602|7603|7604|6051"}] },
{ "mapname": "三家归晋", "mapid": 20, "list": [{ "id": 1095, "type": 1, "BattleName": "东吴势力", "titleindex": 95, "top": 159, "left": 25, "iconid": 3, "time": "840,840,840,840,840,840", "HandIcon": "203,201,1000,1011,3201,5004", "NpcName": "东吴先锋,东吴守卫,东吴禁卫,东吴精锐,凌统,孙权", "detail": "众将士随我一起突击恶贼先锋部队。|虽然胜券在握，也不可掉以轻心！|各军振作精神，击破敌军！|无名小辈！还不下马受死！|亲贤接士，轻财重义，有国士之风。|勇挚刚毅，孤微发迹，导温戮卓，山陵杜塞，有忠壮之烈。", "Reward": "1400,700,1500,0|1400,700,1500,0|1400,700,1500,0|1400,700,1500,0|1410,700,1510,0|1410,700,1510,0", "GetItem": "0|0|0|0|0|6843", "battleLV": "121,121,121,121,121,121" }, { "id": 1096, "type": 1, "BattleName": "蜀汉势力", "titleindex": 96, "top": 74, "left": 82, "iconid": 5, "time": "840,840,840,840,840,840", "HandIcon": "204,203,201,1001,3001,5003", "NpcName": "蜀汉先锋,蜀汉守卫,蜀汉禁卫,蜀汉精锐,张飞,刘备", "detail": "既然来了，就别想走了！|儿郎们，取敌人首级者有赏！|看来尔等也算是有点本事了。|我家主公只求保境安民，汝等何故来犯。|燕人张翼德在此，谁敢一战！！！|天地英雄气，千秋尚凛然。势分三足鼎，业复五铢钱。", "Reward": "1420,710,1520,0|1420,710,1520,0|1420,710,1520,0|1420,710,1520,0|1430,710,1530,0|1430,710,1530,0", "GetItem": "0|0|0|0|0|6843", "battleLV": "122,122,122,122,122,122" }, { "id": 1097, "type": 1, "BattleName": "北魏势力", "titleindex": 97, "top": 153, "left": 176, "iconid": 5, "time": "840,840,840,840,840,840", "HandIcon": "200,201,1010,1105,3103,5005", "NpcName": "北魏先锋,北魏守卫,北魏禁卫,北魏精锐,夏侯惇,曹操", "detail": "乱臣贼子，人人得而诛之。|万箭齐发，让你无处遁形。|混帐！你们这群蠢材，敌人都到家门口了，给我上。|识相的，就在此停步，爷可饶你不死。|开疆展土夏侯惇，枪戟丛中敌万军。 拔矢去眸枯一目，啖睛忿气唤双亲。|宁教我负天下人，莫叫天下人负我！", "Reward": "1440,720,1540,0|1440,720,1540,0|1440,720,1540,0|1440,720,1540,0|1450,720,1550,0|1450,720,1550,0", "GetItem": "0|0|0|0|0|6843", "battleLV": "123,123,123,123,123,123" }, { "id": 1098, "type": 1, "BattleName": "混战中原", "titleindex": 98, "top": 78, "left": 266, "iconid": 6, "time": "840,840,840,840,840,840", "HandIcon": "2027,2036,3301,3306,2030,3304", "NpcName": "公孙瓒,马腾,董卓,孟获,袁术,袁绍", "detail": "乱臣贼子，人人得而诛之。|吾乃先锋，够胆就放马过来吧。|我的严阵以待，断不让你在前进一步！|能杀到我这里，看来你也是一条好汉！|渴思蜜水无由得，独卧空床呕血亡。|志大而智小，色厉而胆薄，忌克而少威。", "Reward": "1460,730,1560,0|1460,730,1560,0|1460,730,1560,0|1460,730,1560,0|1470,730,1570,0|1470,730,1570,0", "GetItem": "0|0|0|0|0|6843", "battleLV": "124,124,124,124,124,124" }, { "id": 1099, "type": 1, "BattleName": "西晋初成", "titleindex": 99, "top": 117, "left": 346, "iconid": 4, "time": "840,840,840,840,840,840", "HandIcon": "1001,1010,1101,1111,1009,5006", "NpcName": "西晋先锋,西晋守卫,西晋禁卫,西晋精锐,司马师,司马懿", "detail": "谋定而后动，方为上上之策！|子元大人，吾等誓不让贼寇前进一步！|宣皇在呢，不能让吾皇小看了！|能到此，也算你功德圆满了。|哀声未绝而便罢息，为臣不忠，为子不孝。|少有奇节，聪明多大略，博学洽闻，伏膺儒教。", "Reward": "1480,740,1580,0|1480,740,1580,0|1480,740,1580,0|1480,740,1580,0|1490,740,1590,0|1490,740,1590,0", "GetItem": "0|0|0|0|0|6843", "battleLV": "125,125,125,125,125,125"}] },
]



var FamousCampaignJson = [
{ "id": 1, "name": "十常侍", "x": 215, "y": 73, "w": 59, "h": 73, "detail": "十常侍，横征暴敛，卖官鬻爵，父兄子弟遍布天下，横行乡里，祸害百姓，无官敢管。", "exp": 1500, "lv": 20, "showtype": 1, "reward": "7499,7498,7498,6601,6520,6611", "rnum": "1,1,1,1,2,2" },
{ "id": 2, "name": "曲阳", "x": 416, "y": 132, "w": 65, "h": 71, "detail": "曲阳，农民起义中，河北黄巾军在下曲阳被汉左中郎将皇甫嵩部击灭的一次重要作战。", "exp": 2500, "lv": 30, "showtype": 1, "reward": "7501,7500,7500,6601,6520,6611", "rnum": "1,1,1,1,2,2" },
{ "id": 3, "name": "虎牢关", "x": 236, "y": 146, "w": 76, "h": 65, "detail": "虎牢关，反董卓联盟杀至洛阳城门户虎牢关突破战神吕布阻击的一场激战。", "exp": 3500, "lv": 40, "showtype": 1, "reward": "7503,7502,7502,6601,6520,6611", "rnum": "1,1,1,1,2,2" },
{ "id": 4, "name": "界桥", "x": 387, "y": 43, "w": 69, "h": 62, "detail": "界桥，袁绍曾与公孙瓒为争夺冀州而在此地大战多日，互有损伤，献帝来使撮合而结束。", "exp": 4500, "lv": 50, "showtype": 1, "reward": "7505,7504,7504,6601,6520,6611", "rnum": "1,1,1,1,2,2" },
{ "id": 5, "name": "官渡", "x": 316, "y": 87, "w": 67, "h": 68, "detail": "官渡，公元200年，袁绍率领大军南下官渡，曹操用计烧毁袁军粮草，夺取最后胜利。", "exp": 5500, "lv": 60, "showtype": 1, "reward": "7507,7506,7506,6601,6520,6611", "rnum": "1,1,1,1,2,2" },
{ "id": 6, "name": "长坂坡", "x": 246, "y": 216, "w": 72, "h": 73, "detail": "长坂坡，曹操追击刘备溃军，赵云单骑救幼主，张飞拒水断桥，演绎了一幕幕为后人津津乐道的佳话。", "exp": 6500, "lv": 70, "showtype": 1, "reward": "7509,7508,7508,6601,6520,6611", "rnum": "1,1,1,1,2,2" },
{ "id": 7, "name": "火烧赤壁", "x": 326, "y": 166, "w": 79, "h": 79, "detail": "孙、刘联军于公元208年在长江赤壁一带大破曹操大军，奠定三国鼎立基础的以少胜多的著名战役。", "exp": 7500, "lv": 80, "showtype": 1, "reward": "7511,7510,7510,6601,6520,6611", "rnum": "1,1,1,1,2,2" },
{ "id": 101, "name": "元宵节", "x": 49, "y": 122, "w": 70, "h": 66, "detail": "古人称夜为“宵”，而十五日又是一年中第一个月圆之夜，所以称正月十五为元宵节。", "exp": 2000, "lv": 20, "showtype": 1, "reward": "6752,6751,6751,6750,6750,6750", "rnum": "1,1,1,1,1,1" },
{ "id": 102, "name": "汉帝灵墓", "x": 50, "y": 36, "w": 78, "h": 77, "detail": "汉高祖刘邦之墓，位于咸阳原最高点之上，集天地之灵气，最终永世长存。", "exp": 3000, "lv": 35, "showtype": 1, "reward": "6553,6552,6552,6551,6551,6551", "rnum": "1,1,1,1,1,1" },
{ "id": 103, "name": "霸王墓", "x": 50, "y": 38, "w": 74, "h": 76, "detail": "项羽笑曰：“天之亡我，我何渡为！纵彼不言，籍独不愧于心乎！”遂自刎于乌江之畔。", "exp": 3000, "lv": 35, "showtype": 1, "reward": "6623,6621,6621,6620,6620,6620", "rnum": "1,1,1,1,1,1" }
]



var FuBenMapJson = [
{ "mapid": 1, "blist": [
{ "icon": 0, "pos": 0, "npos": "2,3", "saying": "0", "x": 251, "y": 311 },
{ "icon": 110, "pos": 1, "npos": "2,4", "saying": "夏恽:我有种不好的预感，我可能要跪…", "x": 100, "y": 238 },
{ "icon": 114, "pos": 2, "npos": "0,1,5", "saying": "郭胜:鼠辈，胆敢伤我！我嗑药去！", "x": 187, "y": 247 },
{ "icon": 115, "pos": 3, "npos": "0,7", "saying": "孙璋:你们忍心让我就这么酱油了？", "x": 330, "y": 264 },
{ "icon": 200, "pos": 4, "npos": "1,9", "saying": "0", "x": 76, "y": 146 },
{ "icon": 303, "pos": 5, "npos": "2,6", "saying": "栗嵩:你也要来几发吗~", "x": 168, "y": 163 },
{ "icon": 300, "pos": 6, "npos": "5,12", "saying": "毕岚:三刀已出，你已经死了！", "x": 248, "y": 115 },
{ "icon": 116, "pos": 7, "npos": "3,13", "saying": "张恭:你的剑就是你的贱~", "x": 367, "y": 182 },
{ "icon": 201, "pos": 8, "npos": "13", "saying": "0", "x": 510, "y": 190 },
{ "icon": 302, "pos": 9, "npos": "4,10", "saying": "张让:看我百步穿菊~千年杀！！！", "x": 44, "y": 59 },
{ "icon": 117, "pos": 10, "npos": "9,11", "saying": "宋典:先说好，不许打脸啊！！！", "x": 161, "y": 70 },
{ "icon": 202, "pos": 11, "npos": "10,12", "saying": "0", "x": 255, "y": 29 },
{ "icon": 304, "pos": 12, "npos": "6,11,13", "saying": "高望:如果我膝盖没中那一箭…", "x": 349, "y": 66 },
{ "icon": 301, "pos": 13, "npos": "7,8,12,14", "saying": "段珪:动我老大者，虽远必诛！", "x": 433, "y": 116 },
{ "icon": 305, "pos": 14, "npos": "13", "saying": "赵忠:你看不见我，看不见我！", "x": 502, "y": 48 }
]
}
, { "mapid": 2, "blist": [
{ "icon": 0, "pos": 0, "npos": "2,3", "saying": "0", "x": 67, "y": 259 },
{ "icon": 103, "pos": 1, "npos": "2", "saying": "精锐:前面的看好门。", "x": 55, "y": 148 },
{ "icon": 101, "pos": 2, "npos": "0,1,5", "saying": "残部:炮灰总是我来做。", "x": 132, "y": 204 },
{ "icon": 102, "pos": 3, "npos": "0,4,6", "saying": "残部:我在哪，在哪，哪…", "x": 205, "y": 232 },
{ "icon": 100, "pos": 4, "npos": "3,7", "saying": "残部:站什么岗，我拿宝箱去。", "x": 300, "y": 261 },
{ "icon": 200, "pos": 5, "npos": "2,8", "saying": "0", "x": 212, "y": 152 },
{ "icon": 101, "pos": 6, "npos": "3,9", "saying": "残部:从我身上踩过去吧！", "x": 297, "y": 192 },
{ "icon": 201, "pos": 7, "npos": "4,10", "saying": "0", "x": 417, "y": 272 },
{ "icon": 105, "pos": 8, "npos": "5,11,12", "saying": "张宝:宝箱都被抢走了。", "x": 300, "y": 88 },
{ "icon": 202, "pos": 9, "npos": "6,12", "saying": "0", "x": 358, "y": 150 },
{ "icon": 102, "pos": 10, "npos": "7,13", "saying": "黄巾残部:芝麻开门~V~", "x": 426, "y": 202 },
{ "icon": 203, "pos": 11, "npos": "8", "saying": "0", "x": 266, "y": 20 },
{ "icon": 104, "pos": 12, "npos": "8,9,13,14", "saying": "张梁:休想伤我大哥。", "x": 413, "y": 106 },
{ "icon": 103, "pos": 13, "npos": "10,12", "saying": "黄巾精锐:看门真心累。", "x": 484, "y": 146 },
{ "icon": 106, "pos": 14, "npos": "12", "saying": "张角:苍天已死，黄天当立！", "x": 484, "y": 56 }
]
}
, { "mapid": 3, "blist": [
{ "icon": 0, "pos": 0, "npos": "2,3,4", "saying": "0", "x": 62, "y": 270 },
{ "icon": 201, "pos": 1, "npos": "2", "saying": "0", "x": 35, "y": 137 },
{ "icon": 114, "pos": 2, "npos": "0,1,5", "saying": "守卫:看门没好结果。", "x": 98, "y": 186 },
{ "icon": 117, "pos": 3, "npos": "0,6", "saying": "精锐:炮灰总是我来做。", "x": 166, "y": 218 },
{ "icon": 115, "pos": 4, "npos": "0,7", "saying": "精锐:站什么岗，我拿宝箱去。", "x": 209, "y": 270 },
{ "icon": 202, "pos": 5, "npos": "2,10", "saying": "0", "x": 191, "y": 143 },
{ "icon": 124, "pos": 6, "npos": "3,11", "saying": "貂蝉:坏银要推倒我了…", "x": 275, "y": 153 },
{ "icon": 111, "pos": 7, "npos": "4,12", "saying": "守卫:从我身上踩过去吧！", "x": 284, "y": 230 },
{ "icon": 203, "pos": 8, "npos": "9", "saying": "0", "x": 116, "y": 16 },
{ "icon": 120, "pos": 9, "npos": "8,10", "saying": "李儒:来来来，尝尝中毒的味道。", "x": 191, "y": 48 },
{ "icon": 119, "pos": 10, "npos": "5,9,11", "saying": "高顺:冲锋陷阵是我的强项。", "x": 260, "y": 77 },
{ "icon": 122, "pos": 11, "npos": "6,10,12,15", "saying": "张辽:我的箭术可不是盖的！", "x": 342, "y": 101 },
{ "icon": 121, "pos": 12, "npos": "7,11,13", "saying": "陈宫:听我的名字就知道我有多成功了。", "x": 363, "y": 176 },
{ "icon": 123, "pos": 13, "npos": "12,14", "saying": "臧霸:宝箱不是你想要，想要就能要。", "x": 440, "y": 173 },
{ "icon": 204, "pos": 14, "npos": "13", "saying": "0", "x": 526, "y": 198 },
{ "icon": 125, "pos": 15, "npos": "11", "saying": "吕布:辽仔把门看好了。", "x": 398, "y": 23 }
]
}
, { "mapid": 4, "blist": [
{ "icon": 0, "pos": 0, "npos": "1,2", "saying": "0", "x": 38, "y": 283 },
{ "icon": 112, "pos": 1, "npos": "0,3", "saying": "守卫:把他们丢水里喂金鱼~", "x": 29, "y": 201 },
{ "icon": 112, "pos": 2, "npos": "0,4,5", "saying": "守卫:过了河可不许拆桥啊！", "x": 166, "y": 274 },
{ "icon": 117, "pos": 3, "npos": "1,6", "saying": "义从:想伤伦家的哈尼，不可饶恕~", "x": 80, "y": 146 },
{ "icon": 304, "pos": 4, "npos": "2,7,8", "saying": "关靖:我还会再回来的...", "x": 187, "y": 204 },
{ "icon": 115, "pos": 5, "npos": "2,9", "saying": "精锐:我有种不好的预感，我可能要跪…", "x": 291, "y": 268 },
{ "icon": 132, "pos": 6, "npos": "3,7", "saying": "公孙瓒:我也是骑白马滴~咋没人逼婚呢~", "x": 133, "y": 102 },
{ "icon": 130, "pos": 7, "npos": "4,6,11", "saying": "严纲:如果我膝盖没中那一箭…", "x": 218, "y": 140 },
{ "icon": 201, "pos": 8, "npos": "4,12", "saying": "0", "x": 309, "y": 186 },
{ "icon": 200, "pos": 9, "npos": "5,13", "saying": "0", "x": 400, "y": 263 },
{ "icon": 203, "pos": 10, "npos": "11", "saying": "0", "x": 217, "y": 43 },
{ "icon": 114, "pos": 11, "npos": "7,10,12,15", "saying": "精锐:等一下，我找把刀先~", "x": 299, "y": 97 },
{ "icon": 116, "pos": 12, "npos": "8,11,13,16", "saying": "义从:停车收费！", "x": 405, "y": 145 },
{ "icon": 305, "pos": 13, "npos": "9,12,14", "saying": "精锐:靠边停车，俺们这拍戏呢~", "x": 460, "y": 199 },
{ "icon": 200, "pos": 14, "npos": "13", "saying": "0", "x": 549, "y": 202 },
{ "icon": 202, "pos": 15, "npos": "11,17", "saying": "0", "x": 359, "y": 47 },
{ "icon": 131, "pos": 16, "npos": "12,18", "saying": "赵云:一点寒芒先到，随后枪出如龙~", "x": 476, "y": 99 },
{ "icon": 304, "pos": 17, "npos": "15,18", "saying": "田楷:敢动老子，不知道老子是城管么~", "x": 424, "y": 12 },
{ "icon": 204, "pos": 18, "npos": "16,17", "saying": "0", "x": 537, "y": 66 }
]
}
, { "mapid": 5, "blist": [
{ "icon": 0, "pos": 0, "npos": "3,4,5", "saying": "0", "x": 178, "y": 286 },
{ "icon": 203, "pos": 1, "npos": "2,6", "saying": "0", "x": 51, "y": 105 },
{ "icon": 141, "pos": 2, "npos": "1,3", "saying": "文丑:其实我的文笔很好的说~", "x": 142, "y": 111 },
{ "icon": 111, "pos": 3, "npos": "0,2,7", "saying": "精锐:你们忍心让我就这么酱油了？", "x": 206, "y": 177 },
{ "icon": 117, "pos": 4, "npos": "0,8", "saying": "精锐:姑娘，你真是条汉子~", "x": 270, "y": 225 },
{ "icon": 115, "pos": 5, "npos": "0,9", "saying": "精锐:先说好，不许打脸啊！！！", "x": 328, "y": 291 },
{ "icon": 303, "pos": 6, "npos": "1,10", "saying": "淳于琼:客官，有空没空都别来了~", "x": 147, "y": 32 },
{ "icon": 143, "pos": 7, "npos": "3,10", "saying": "沮授:一只穿云箭，千军万马来相见~", "x": 264, "y": 105 },
{ "icon": 302, "pos": 8, "npos": "4,11", "saying": "何茂:有种等着，我叫人先~", "x": 357, "y": 173 },
{ "icon": 300, "pos": 9, "npos": "5,13", "saying": "韩猛:鼠辈，胆敢伤我！我嗑药去！", "x": 423, "y": 249 },
{ "icon": 202, "pos": 10, "npos": "6,7,11", "saying": "0", "x": 275, "y": 27 },
{ "icon": 142, "pos": 11, "npos": "8,10,12,14", "saying": "颜良:人如其名，我长相不错吧~", "x": 369, "y": 85 },
{ "icon": 204, "pos": 12, "npos": "11,13,15", "saying": "0", "x": 477, "y": 148 },
{ "icon": 145, "pos": 13, "npos": "9,12", "saying": "田丰:俺只是种地的啊~", "x": 518, "y": 228 },
{ "icon": 146, "pos": 14, "npos": "11,15", "saying": "袁绍:孩儿们，男的宰了，女的抓回去！", "x": 467, "y": 26 },
{ "icon": 140, "pos": 15, "npos": "12,14", "saying": "高览:看我百步穿菊~千年杀！！！", "x": 537, "y": 89 }
]
}
, { "mapid": 6, "blist": [
{ "icon": 0, "pos": 0, "npos": "1,4,5", "saying": "0", "x": 80, "y": 298 },
{ "icon": 117, "pos": 1, "npos": "0,2", "saying": "虎豹骑：前面的车，靠边停下！", "x": 258, "y": 307 },
{ "icon": 303, "pos": 2, "npos": "1,6", "saying": "夏侯杰：吓死伦家了~~~", "x": 360, "y": 278 },
{ "icon": 115, "pos": 3, "npos": "6", "saying": "虎豹骑：开门开门，查水表了！", "x": 516, "y": 217 },
{ "icon": 115, "pos": 4, "npos": "0,7", "saying": "虎豹骑：来者何人，速速报上名来！", "x": 71, "y": 197 },
{ "icon": 111, "pos": 5, "npos": "0,8", "saying": "虎豹骑：无名小卒，尔敢阻我！", "x": 181, "y": 226 },
{ "icon": 147, "pos": 6, "npos": "2,3", "saying": "张飞：身是张翼德也，可来共决死！", "x": 407, "y": 186 },
{ "icon": 111, "pos": 7, "npos": "4,8,13", "saying": "虎豹骑：冲啊，活捉赵子龙，主公有赏！", "x": 64, "y": 116 },
{ "icon": 205, "pos": 8, "npos": "5,7,9", "saying": "0", "x": 173, "y": 126 },
{ "icon": 117, "pos": 9, "npos": "8,10", "saying": "虎豹骑：奉主公之命，活捉赵子龙！", "x": 264, "y": 156 },
{ "icon": 115, "pos": 10, "npos": "9,11", "saying": "虎豹骑：赵子龙，速速投降吧~", "x": 337, "y": 105 },
{ "icon": 115, "pos": 11, "npos": "10,12,15", "saying": "虎豹骑：主公有令，抓活的！", "x": 420, "y": 86 },
{ "icon": 131, "pos": 12, "npos": "11", "saying": "赵云:一点寒芒先到，随后枪出如龙~", "x": 516, "y": 119 },
{ "icon": 117, "pos": 13, "npos": "7,14", "saying": "曹纯：我可是纯爷们！", "x": 154, "y": 38 },
{ "icon": 300, "pos": 14, "npos": "13,15", "saying": "虎豹骑：你们忍心让我就这么酱油了？", "x": 247, "y": 38 },
{ "icon": 203, "pos": 15, "npos": "11,14", "saying": "0", "x": 347, "y": 13 }
]
}
, { "mapid": 7, "blist": [
{ "icon": 0, "pos": 0, "npos": "1,2,4", "saying": "0", "x": 62, "y": 274 },
{ "icon": 115, "pos": 1, "npos": "0,7", "saying": "联军：这么大范围的集体烧烤，好热啊！", "x": 27, "y": 158 },
{ "icon": 111, "pos": 2, "npos": "0,3,9", "saying": "联军：水上都烧得这么旺~~~", "x": 124, "y": 200 },
{ "icon": 202, "pos": 3, "npos": "2,10", "saying": "0", "x": 234, "y": 233 },
{ "icon": 112, "pos": 4, "npos": "0,5", "saying": "联军：曹贼就这么被烧死了？", "x": 295, "y": 291 },
{ "icon": 111, "pos": 5, "npos": "4,11", "saying": "联军：烧吧，死道友不死贫道，嘿嘿！", "x": 443, "y": 272 },
{ "icon": 303, "pos": 6, "npos": "7,13", "saying": "联军：孔明先生真乃神人，能呼风唤雨啊！", "x": 60, "y": 22 },
{ "icon": 117, "pos": 7, "npos": "1,6,8", "saying": "联军：额，这逆向的西风啊，你喝多了吧！", "x": 123, "y": 68 },
{ "icon": 203, "pos": 8, "npos": "7,9", "saying": "0", "x": 187, "y": 106 },
{ "icon": 117, "pos": 9, "npos": "2,8,10,15", "saying": "联军：可怜的草人兄，万箭穿心啊！", "x": 260, "y": 145 },
{ "icon": 300, "pos": 10, "npos": "3,9,11,15", "saying": "联军：-_-#黄将军是M属性的说………", "x": 327, "y": 168 },
{ "icon": 205, "pos": 11, "npos": "5,10,12", "saying": "0", "x": 404, "y": 188 },
{ "icon": 148, "pos": 12, "npos": "11,16", "saying": "黄盖:鞭笞我吧，公瑾！", "x": 557, "y": 210 },
{ "icon": 117, "pos": 13, "npos": "6,14", "saying": "联军：周都督是S属性吗？⊙﹏⊙", "x": 198, "y": 2 },
{ "icon": 205, "pos": 14, "npos": "13,15,17", "saying": "0", "x": 348, "y": 27 },
{ "icon": 112, "pos": 15, "npos": "9,10,14,16,17", "saying": "联军：大都督，诸葛亮跑了~~~", "x": 418, "y": 85 },
{ "icon": 115, "pos": 16, "npos": "12,15", "saying": "联军：跑了？那快去追啊！", "x": 531, "y": 111 },
{ "icon": 149, "pos": 17, "npos": "14,15", "saying": "周瑜：既生瑜，何生亮啊！", "x": 455, "y": 1 }
]
}
, { "mapid": 101, "blist": [
{ "icon": 0, "pos": 0, "npos": "1,2,4", "saying": "0", "x": 53, "y": 200 },
{ "icon": 141, "pos": 1, "npos": "0,3", "saying": "文丑:其实我的文笔很好的说~", "x": 61, "y": 113 },
{ "icon": 142, "pos": 2, "npos": "0,5", "saying": "颜良:人如其名，我长相不错吧~", "x": 74, "y": 288 },
{ "icon": 105, "pos": 3, "npos": "1,6", "saying": "张宝:宝箱都被抢走了。", "x": 150, "y": 86 },
{ "icon": 104, "pos": 4, "npos": "0,7", "saying": "张梁:休想伤我大哥。", "x": 164, "y": 189 },
{ "icon": 106, "pos": 5, "npos": "2,8", "saying": "张角:苍天已死，黄天当立！", "x": 171, "y": 285 },
{ "icon": 146, "pos": 6, "npos": "3,9", "saying": "袁绍:孩儿们，男的宰了，女的抓回去！", "x": 261, "y": 90 },
{ "icon": 202, "pos": 7, "npos": "4,10", "saying": "0", "x": 270, "y": 187 },
{ "icon": 132, "pos": 8, "npos": "5,11", "saying": "公孙瓒:我也是骑白马滴~咋没人逼婚呢~", "x": 286, "y": 289 },
{ "icon": 202, "pos": 9, "npos": "6,12", "saying": "0", "x": 361, "y": 55 },
{ "icon": 122, "pos": 10, "npos": "7,12,13", "saying": "张辽:我的箭术可不是盖的！", "x": 366, "y": 173 },
{ "icon": 202, "pos": 11, "npos": "8,13", "saying": "0", "x": 406, "y": 277 },
{ "icon": 131, "pos": 12, "npos": "9,10,14", "saying": "赵云:一点寒芒先到，随后枪出如龙~", "x": 455, "y": 102 },
{ "icon": 125, "pos": 13, "npos": "10,11,14", "saying": "吕布:辽仔把门看好了。", "x": 480, "y": 213 },
{ "icon": 124, "pos": 14, "npos": "12,13", "saying": "貂蝉:坏银要推倒我了…", "x": 538, "y": 134 }
]
}
, { "mapid": 102, "blist": [
{ "icon": 0, "pos": 0, "npos": "1,5,7", "saying": "0", "x": 89, "y": 266 },
{ "icon": 410, "pos": 1, "npos": "0,2", "saying": "张良：凡人，献上你的血肉吧！", "x": 201, "y": 289 },
{ "icon": 413, "pos": 2, "npos": "1,3", "saying": "卫士：吼~~~", "x": 283, "y": 249 },
{ "icon": 204, "pos": 3, "npos": "2,4,11", "saying": "0", "x": 366, "y": 228 },
{ "icon": 413, "pos": 4, "npos": "3", "saying": "卫士：嘶~~~", "x": 500, "y": 249 },
{ "icon": 409, "pos": 5, "npos": "0,6", "saying": "彭越：好久没品尝到新鲜的人肉了！", "x": 43, "y": 186 },
{ "icon": 411, "pos": 6, "npos": "5,12,13", "saying": "卫士：吸~~~", "x": 125, "y": 139 },
{ "icon": 408, "pos": 7, "npos": "0,8", "saying": "陈平：血肉，新鲜的血肉，啊~~~", "x": 156, "y": 220 },
{ "icon": 412, "pos": 8, "npos": "7,9", "saying": "卫士：吸~~~", "x": 217, "y": 181 },
{ "icon": 411, "pos": 9, "npos": "8,10", "saying": "卫士：吼~~~", "x": 283, "y": 147 },
{ "icon": 402, "pos": 10, "npos": "9,11,14,15", "saying": "萧何：我闻到食物的味道了~", "x": 354, "y": 119 },
{ "icon": 401, "pos": 11, "npos": "3,10", "saying": "樊哙：多少年了，终于再次见到活人了。", "x": 433, "y": 175 },
{ "icon": 412, "pos": 12, "npos": "6", "saying": "卫士：嘶~~~", "x": 54, "y": 74 },
{ "icon": 204, "pos": 13, "npos": "6,14", "saying": "0", "x": 178, "y": 66 },
{ "icon": 403, "pos": 14, "npos": "10,13", "saying": "韩信：吾乃上将军韩信是也，尔等受死！", "x": 260, "y": 66 },
{ "icon": 400, "pos": 15, "npos": "10", "saying": "刘邦：愚蠢的凡人，敢打扰孤王的长眠~", "x": 426, "y": 52 }
]
}
, { "mapid": 103, "blist": [
{ "icon": 0, "pos": 0, "npos": "1,5,7", "saying": "0", "x": 89, "y": 266 },
{ "icon": 410, "pos": 1, "npos": "0,2", "saying": "亡魂：杀！！！杀光他们！！！", "x": 201, "y": 289 },
{ "icon": 413, "pos": 2, "npos": "1,3", "saying": "亡魂：我等八千江东子弟，足踏平他汉室！", "x": 283, "y": 249 },
{ "icon": 204, "pos": 3, "npos": "2,4,11", "saying": "0", "x": 366, "y": 228 },
{ "icon": 413, "pos": 4, "npos": "3", "saying": "亡魂：死后都得不到安宁吗？", "x": 500, "y": 249 },
{ "icon": 409, "pos": 5, "npos": "0,6", "saying": "亡魂：打扰亡者的长眠是会遭报应的！", "x": 43, "y": 186 },
{ "icon": 411, "pos": 6, "npos": "5,12,13", "saying": "亡魂：死又何惧，我已经死过一次了。", "x": 125, "y": 139 },
{ "icon": 408, "pos": 7, "npos": "0,8", "saying": "亡魂：汝等是来投靠我家霸王的吗？", "x": 156, "y": 220 },
{ "icon": 412, "pos": 8, "npos": "7,9", "saying": "亡魂：死又何惧，我已经死过一次了。", "x": 217, "y": 181 },
{ "icon": 411, "pos": 9, "npos": "8,10", "saying": "亡魂：死又何惧，我已经死过一次了。", "x": 283, "y": 147 },
{ "icon": 406, "pos": 10, "npos": "9,11,14,15", "saying": "项伯：我们还是回江东吧~", "x": 354, "y": 119 },
{ "icon": 405, "pos": 11, "npos": "3,10", "saying": "项庄：若是让我见到刘邦，必一剑杀了他！", "x": 433, "y": 175 },
{ "icon": 412, "pos": 12, "npos": "6", "saying": "亡魂：死又何惧，我已经死过一次了。", "x": 54, "y": 74 },
{ "icon": 204, "pos": 13, "npos": "6,14", "saying": "0", "x": 178, "y": 66 },
{ "icon": 407, "pos": 14, "npos": "10,13", "saying": "项梁：霸王，我们去攻打刘邦吧！", "x": 260, "y": 66 },
{ "icon": 404, "pos": 15, "npos": "10", "saying": "项羽：吾乃西楚霸王，何人来此造次！", "x": 426, "y": 52 }
]
}
]
var FuBenMapJson = [
{ "mapid": 1, "blist": [
{ "icon": 0, "pos": 0, "npos": "2,3", "saying": "0", "x": 251, "y": 311 },
{ "icon": 110, "pos": 1, "npos": "2,4", "saying": "夏恽:我有种不好的预感，我可能要跪…", "x": 100, "y": 238 },
{ "icon": 114, "pos": 2, "npos": "0,1,5", "saying": "郭胜:鼠辈，胆敢伤我！我嗑药去！", "x": 187, "y": 247 },
{ "icon": 115, "pos": 3, "npos": "0,7", "saying": "孙璋:你们忍心让我就这么酱油了？", "x": 330, "y": 264 },
{ "icon": 200, "pos": 4, "npos": "1,9", "saying": "0", "x": 76, "y": 146 },
{ "icon": 303, "pos": 5, "npos": "2,6", "saying": "栗嵩:你也要来几发吗~", "x": 168, "y": 163 },
{ "icon": 300, "pos": 6, "npos": "5,12", "saying": "毕岚:三刀已出，你已经死了！", "x": 248, "y": 115 },
{ "icon": 116, "pos": 7, "npos": "3,13", "saying": "张恭:你的剑就是你的贱~", "x": 367, "y": 182 },
{ "icon": 201, "pos": 8, "npos": "13", "saying": "0", "x": 510, "y": 190 },
{ "icon": 302, "pos": 9, "npos": "4,10", "saying": "张让:看我百步穿菊~千年杀！！！", "x": 44, "y": 59 },
{ "icon": 117, "pos": 10, "npos": "9,11", "saying": "宋典:先说好，不许打脸啊！！！", "x": 161, "y": 70 },
{ "icon": 202, "pos": 11, "npos": "10,12", "saying": "0", "x": 255, "y": 29 },
{ "icon": 304, "pos": 12, "npos": "6,11,13", "saying": "高望:如果我膝盖没中那一箭…", "x": 349, "y": 66 },
{ "icon": 301, "pos": 13, "npos": "7,8,12,14", "saying": "段珪:动我老大者，虽远必诛！", "x": 433, "y": 116 },
{ "icon": 305, "pos": 14, "npos": "13", "saying": "赵忠:你看不见我，看不见我！", "x": 502, "y": 48 }
]
}
, { "mapid": 2, "blist": [
{ "icon": 0, "pos": 0, "npos": "2,3", "saying": "0", "x": 67, "y": 259 },
{ "icon": 103, "pos": 1, "npos": "2", "saying": "精锐:前面的看好门。", "x": 55, "y": 148 },
{ "icon": 101, "pos": 2, "npos": "0,1,5", "saying": "残部:炮灰总是我来做。", "x": 132, "y": 204 },
{ "icon": 102, "pos": 3, "npos": "0,4,6", "saying": "残部:我在哪，在哪，哪…", "x": 205, "y": 232 },
{ "icon": 100, "pos": 4, "npos": "3,7", "saying": "残部:站什么岗，我拿宝箱去。", "x": 300, "y": 261 },
{ "icon": 200, "pos": 5, "npos": "2,8", "saying": "0", "x": 212, "y": 152 },
{ "icon": 101, "pos": 6, "npos": "3,9", "saying": "残部:从我身上踩过去吧！", "x": 297, "y": 192 },
{ "icon": 201, "pos": 7, "npos": "4,10", "saying": "0", "x": 417, "y": 272 },
{ "icon": 105, "pos": 8, "npos": "5,11,12", "saying": "张宝:宝箱都被抢走了。", "x": 300, "y": 88 },
{ "icon": 202, "pos": 9, "npos": "6,12", "saying": "0", "x": 358, "y": 150 },
{ "icon": 102, "pos": 10, "npos": "7,13", "saying": "黄巾残部:芝麻开门~V~", "x": 426, "y": 202 },
{ "icon": 203, "pos": 11, "npos": "8", "saying": "0", "x": 266, "y": 20 },
{ "icon": 104, "pos": 12, "npos": "8,9,13,14", "saying": "张梁:休想伤我大哥。", "x": 413, "y": 106 },
{ "icon": 103, "pos": 13, "npos": "10,12", "saying": "黄巾精锐:看门真心累。", "x": 484, "y": 146 },
{ "icon": 106, "pos": 14, "npos": "12", "saying": "张角:苍天已死，黄天当立！", "x": 484, "y": 56 }
]
}
, { "mapid": 3, "blist": [
{ "icon": 0, "pos": 0, "npos": "2,3,4", "saying": "0", "x": 62, "y": 270 },
{ "icon": 201, "pos": 1, "npos": "2", "saying": "0", "x": 35, "y": 137 },
{ "icon": 114, "pos": 2, "npos": "0,1,5", "saying": "守卫:看门没好结果。", "x": 98, "y": 186 },
{ "icon": 117, "pos": 3, "npos": "0,6", "saying": "精锐:炮灰总是我来做。", "x": 166, "y": 218 },
{ "icon": 115, "pos": 4, "npos": "0,7", "saying": "精锐:站什么岗，我拿宝箱去。", "x": 209, "y": 270 },
{ "icon": 202, "pos": 5, "npos": "2,10", "saying": "0", "x": 191, "y": 143 },
{ "icon": 124, "pos": 6, "npos": "3,11", "saying": "貂蝉:坏银要推倒我了…", "x": 275, "y": 153 },
{ "icon": 111, "pos": 7, "npos": "4,12", "saying": "守卫:从我身上踩过去吧！", "x": 284, "y": 230 },
{ "icon": 203, "pos": 8, "npos": "9", "saying": "0", "x": 116, "y": 16 },
{ "icon": 120, "pos": 9, "npos": "8,10", "saying": "李儒:来来来，尝尝中毒的味道。", "x": 191, "y": 48 },
{ "icon": 119, "pos": 10, "npos": "5,9,11", "saying": "高顺:冲锋陷阵是我的强项。", "x": 260, "y": 77 },
{ "icon": 122, "pos": 11, "npos": "6,10,12,15", "saying": "张辽:我的箭术可不是盖的！", "x": 342, "y": 101 },
{ "icon": 121, "pos": 12, "npos": "7,11,13", "saying": "陈宫:听我的名字就知道我有多成功了。", "x": 363, "y": 176 },
{ "icon": 123, "pos": 13, "npos": "12,14", "saying": "臧霸:宝箱不是你想要，想要就能要。", "x": 440, "y": 173 },
{ "icon": 204, "pos": 14, "npos": "13", "saying": "0", "x": 526, "y": 198 },
{ "icon": 125, "pos": 15, "npos": "11", "saying": "吕布:辽仔把门看好了。", "x": 398, "y": 23 }
]
}
, { "mapid": 4, "blist": [
{ "icon": 0, "pos": 0, "npos": "1,2", "saying": "0", "x": 38, "y": 283 },
{ "icon": 112, "pos": 1, "npos": "0,3", "saying": "守卫:把他们丢水里喂金鱼~", "x": 29, "y": 201 },
{ "icon": 112, "pos": 2, "npos": "0,4,5", "saying": "守卫:过了河可不许拆桥啊！", "x": 166, "y": 274 },
{ "icon": 117, "pos": 3, "npos": "1,6", "saying": "义从:想伤伦家的哈尼，不可饶恕~", "x": 80, "y": 146 },
{ "icon": 304, "pos": 4, "npos": "2,7,8", "saying": "关靖:我还会再回来的...", "x": 187, "y": 204 },
{ "icon": 115, "pos": 5, "npos": "2,9", "saying": "精锐:我有种不好的预感，我可能要跪…", "x": 291, "y": 268 },
{ "icon": 132, "pos": 6, "npos": "3,7", "saying": "公孙瓒:我也是骑白马滴~咋没人逼婚呢~", "x": 133, "y": 102 },
{ "icon": 130, "pos": 7, "npos": "4,6,11", "saying": "严纲:如果我膝盖没中那一箭…", "x": 218, "y": 140 },
{ "icon": 201, "pos": 8, "npos": "4,12", "saying": "0", "x": 309, "y": 186 },
{ "icon": 200, "pos": 9, "npos": "5,13", "saying": "0", "x": 400, "y": 263 },
{ "icon": 203, "pos": 10, "npos": "11", "saying": "0", "x": 217, "y": 43 },
{ "icon": 114, "pos": 11, "npos": "7,10,12,15", "saying": "精锐:等一下，我找把刀先~", "x": 299, "y": 97 },
{ "icon": 116, "pos": 12, "npos": "8,11,13,16", "saying": "义从:停车收费！", "x": 405, "y": 145 },
{ "icon": 305, "pos": 13, "npos": "9,12,14", "saying": "精锐:靠边停车，俺们这拍戏呢~", "x": 460, "y": 199 },
{ "icon": 200, "pos": 14, "npos": "13", "saying": "0", "x": 549, "y": 202 },
{ "icon": 202, "pos": 15, "npos": "11,17", "saying": "0", "x": 359, "y": 47 },
{ "icon": 131, "pos": 16, "npos": "12,18", "saying": "赵云:一点寒芒先到，随后枪出如龙~", "x": 476, "y": 99 },
{ "icon": 304, "pos": 17, "npos": "15,18", "saying": "田楷:敢动老子，不知道老子是城管么~", "x": 424, "y": 12 },
{ "icon": 204, "pos": 18, "npos": "16,17", "saying": "0", "x": 537, "y": 66 }
]
}
, { "mapid": 5, "blist": [
{ "icon": 0, "pos": 0, "npos": "3,4,5", "saying": "0", "x": 178, "y": 286 },
{ "icon": 203, "pos": 1, "npos": "2,6", "saying": "0", "x": 51, "y": 105 },
{ "icon": 141, "pos": 2, "npos": "1,3", "saying": "文丑:其实我的文笔很好的说~", "x": 142, "y": 111 },
{ "icon": 111, "pos": 3, "npos": "0,2,7", "saying": "精锐:你们忍心让我就这么酱油了？", "x": 206, "y": 177 },
{ "icon": 117, "pos": 4, "npos": "0,8", "saying": "精锐:姑娘，你真是条汉子~", "x": 270, "y": 225 },
{ "icon": 115, "pos": 5, "npos": "0,9", "saying": "精锐:先说好，不许打脸啊！！！", "x": 328, "y": 291 },
{ "icon": 303, "pos": 6, "npos": "1,10", "saying": "淳于琼:客官，有空没空都别来了~", "x": 147, "y": 32 },
{ "icon": 143, "pos": 7, "npos": "3,10", "saying": "沮授:一只穿云箭，千军万马来相见~", "x": 264, "y": 105 },
{ "icon": 302, "pos": 8, "npos": "4,11", "saying": "何茂:有种等着，我叫人先~", "x": 357, "y": 173 },
{ "icon": 300, "pos": 9, "npos": "5,13", "saying": "韩猛:鼠辈，胆敢伤我！我嗑药去！", "x": 423, "y": 249 },
{ "icon": 202, "pos": 10, "npos": "6,7,11", "saying": "0", "x": 275, "y": 27 },
{ "icon": 142, "pos": 11, "npos": "8,10,12,14", "saying": "颜良:人如其名，我长相不错吧~", "x": 369, "y": 85 },
{ "icon": 204, "pos": 12, "npos": "11,13,15", "saying": "0", "x": 477, "y": 148 },
{ "icon": 145, "pos": 13, "npos": "9,12", "saying": "田丰:俺只是种地的啊~", "x": 518, "y": 228 },
{ "icon": 146, "pos": 14, "npos": "11,15", "saying": "袁绍:孩儿们，男的宰了，女的抓回去！", "x": 467, "y": 26 },
{ "icon": 140, "pos": 15, "npos": "12,14", "saying": "高览:看我百步穿菊~千年杀！！！", "x": 537, "y": 89 }
]
}
, { "mapid": 6, "blist": [
{ "icon": 0, "pos": 0, "npos": "1,4,5", "saying": "0", "x": 80, "y": 298 },
{ "icon": 117, "pos": 1, "npos": "0,2", "saying": "虎豹骑：前面的车，靠边停下！", "x": 258, "y": 307 },
{ "icon": 303, "pos": 2, "npos": "1,6", "saying": "夏侯杰：吓死伦家了~~~", "x": 360, "y": 278 },
{ "icon": 115, "pos": 3, "npos": "6", "saying": "虎豹骑：开门开门，查水表了！", "x": 516, "y": 217 },
{ "icon": 115, "pos": 4, "npos": "0,7", "saying": "虎豹骑：来者何人，速速报上名来！", "x": 71, "y": 197 },
{ "icon": 111, "pos": 5, "npos": "0,8", "saying": "虎豹骑：无名小卒，尔敢阻我！", "x": 181, "y": 226 },
{ "icon": 147, "pos": 6, "npos": "2,3", "saying": "张飞：身是张翼德也，可来共决死！", "x": 407, "y": 186 },
{ "icon": 111, "pos": 7, "npos": "4,8,13", "saying": "虎豹骑：冲啊，活捉赵子龙，主公有赏！", "x": 64, "y": 116 },
{ "icon": 205, "pos": 8, "npos": "5,7,9", "saying": "0", "x": 173, "y": 126 },
{ "icon": 117, "pos": 9, "npos": "8,10", "saying": "虎豹骑：奉主公之命，活捉赵子龙！", "x": 264, "y": 156 },
{ "icon": 115, "pos": 10, "npos": "9,11", "saying": "虎豹骑：赵子龙，速速投降吧~", "x": 337, "y": 105 },
{ "icon": 115, "pos": 11, "npos": "10,12,15", "saying": "虎豹骑：主公有令，抓活的！", "x": 420, "y": 86 },
{ "icon": 131, "pos": 12, "npos": "11", "saying": "赵云:一点寒芒先到，随后枪出如龙~", "x": 516, "y": 119 },
{ "icon": 117, "pos": 13, "npos": "7,14", "saying": "曹纯：我可是纯爷们！", "x": 154, "y": 38 },
{ "icon": 300, "pos": 14, "npos": "13,15", "saying": "虎豹骑：你们忍心让我就这么酱油了？", "x": 247, "y": 38 },
{ "icon": 203, "pos": 15, "npos": "11,14", "saying": "0", "x": 347, "y": 13 }
]
}
, { "mapid": 7, "blist": [
{ "icon": 0, "pos": 0, "npos": "1,2,4", "saying": "0", "x": 62, "y": 274 },
{ "icon": 115, "pos": 1, "npos": "0,7", "saying": "联军：这么大范围的集体烧烤，好热啊！", "x": 27, "y": 158 },
{ "icon": 111, "pos": 2, "npos": "0,3,9", "saying": "联军：水上都烧得这么旺~~~", "x": 124, "y": 200 },
{ "icon": 202, "pos": 3, "npos": "2,10", "saying": "0", "x": 234, "y": 233 },
{ "icon": 112, "pos": 4, "npos": "0,5", "saying": "联军：曹贼就这么被烧死了？", "x": 295, "y": 291 },
{ "icon": 111, "pos": 5, "npos": "4,11", "saying": "联军：烧吧，死道友不死贫道，嘿嘿！", "x": 443, "y": 272 },
{ "icon": 303, "pos": 6, "npos": "7,13", "saying": "联军：孔明先生真乃神人，能呼风唤雨啊！", "x": 60, "y": 22 },
{ "icon": 117, "pos": 7, "npos": "1,6,8", "saying": "联军：额，这逆向的西风啊，你喝多了吧！", "x": 123, "y": 68 },
{ "icon": 203, "pos": 8, "npos": "7,9", "saying": "0", "x": 187, "y": 106 },
{ "icon": 117, "pos": 9, "npos": "2,8,10,15", "saying": "联军：可怜的草人兄，万箭穿心啊！", "x": 260, "y": 145 },
{ "icon": 300, "pos": 10, "npos": "3,9,11,15", "saying": "联军：-_-#黄将军是M属性的说………", "x": 327, "y": 168 },
{ "icon": 205, "pos": 11, "npos": "5,10,12", "saying": "0", "x": 404, "y": 188 },
{ "icon": 148, "pos": 12, "npos": "11,16", "saying": "黄盖:鞭笞我吧，公瑾！", "x": 557, "y": 210 },
{ "icon": 117, "pos": 13, "npos": "6,14", "saying": "联军：周都督是S属性吗？⊙﹏⊙", "x": 198, "y": 2 },
{ "icon": 205, "pos": 14, "npos": "13,15,17", "saying": "0", "x": 348, "y": 27 },
{ "icon": 112, "pos": 15, "npos": "9,10,14,16,17", "saying": "联军：大都督，诸葛亮跑了~~~", "x": 418, "y": 85 },
{ "icon": 115, "pos": 16, "npos": "12,15", "saying": "联军：跑了？那快去追啊！", "x": 531, "y": 111 },
{ "icon": 149, "pos": 17, "npos": "14,15", "saying": "周瑜：既生瑜，何生亮啊！", "x": 455, "y": 1 }
]
}
, { "mapid": 101, "blist": [
{ "icon": 0, "pos": 0, "npos": "1,2,4", "saying": "0", "x": 53, "y": 200 },
{ "icon": 141, "pos": 1, "npos": "0,3", "saying": "文丑:其实我的文笔很好的说~", "x": 61, "y": 113 },
{ "icon": 142, "pos": 2, "npos": "0,5", "saying": "颜良:人如其名，我长相不错吧~", "x": 74, "y": 288 },
{ "icon": 105, "pos": 3, "npos": "1,6", "saying": "张宝:宝箱都被抢走了。", "x": 150, "y": 86 },
{ "icon": 104, "pos": 4, "npos": "0,7", "saying": "张梁:休想伤我大哥。", "x": 164, "y": 189 },
{ "icon": 106, "pos": 5, "npos": "2,8", "saying": "张角:苍天已死，黄天当立！", "x": 171, "y": 285 },
{ "icon": 146, "pos": 6, "npos": "3,9", "saying": "袁绍:孩儿们，男的宰了，女的抓回去！", "x": 261, "y": 90 },
{ "icon": 202, "pos": 7, "npos": "4,10", "saying": "0", "x": 270, "y": 187 },
{ "icon": 132, "pos": 8, "npos": "5,11", "saying": "公孙瓒:我也是骑白马滴~咋没人逼婚呢~", "x": 286, "y": 289 },
{ "icon": 202, "pos": 9, "npos": "6,12", "saying": "0", "x": 361, "y": 55 },
{ "icon": 122, "pos": 10, "npos": "7,12,13", "saying": "张辽:我的箭术可不是盖的！", "x": 366, "y": 173 },
{ "icon": 202, "pos": 11, "npos": "8,13", "saying": "0", "x": 406, "y": 277 },
{ "icon": 131, "pos": 12, "npos": "9,10,14", "saying": "赵云:一点寒芒先到，随后枪出如龙~", "x": 455, "y": 102 },
{ "icon": 125, "pos": 13, "npos": "10,11,14", "saying": "吕布:辽仔把门看好了。", "x": 480, "y": 213 },
{ "icon": 124, "pos": 14, "npos": "12,13", "saying": "貂蝉:坏银要推倒我了…", "x": 538, "y": 134 }
]
}
, { "mapid": 102, "blist": [
{ "icon": 0, "pos": 0, "npos": "1,5,7", "saying": "0", "x": 89, "y": 266 },
{ "icon": 410, "pos": 1, "npos": "0,2", "saying": "张良：凡人，献上你的血肉吧！", "x": 201, "y": 289 },
{ "icon": 413, "pos": 2, "npos": "1,3", "saying": "卫士：吼~~~", "x": 283, "y": 249 },
{ "icon": 204, "pos": 3, "npos": "2,4,11", "saying": "0", "x": 366, "y": 228 },
{ "icon": 413, "pos": 4, "npos": "3", "saying": "卫士：嘶~~~", "x": 500, "y": 249 },
{ "icon": 409, "pos": 5, "npos": "0,6", "saying": "彭越：好久没品尝到新鲜的人肉了！", "x": 43, "y": 186 },
{ "icon": 411, "pos": 6, "npos": "5,12,13", "saying": "卫士：吸~~~", "x": 125, "y": 139 },
{ "icon": 408, "pos": 7, "npos": "0,8", "saying": "陈平：血肉，新鲜的血肉，啊~~~", "x": 156, "y": 220 },
{ "icon": 412, "pos": 8, "npos": "7,9", "saying": "卫士：吸~~~", "x": 217, "y": 181 },
{ "icon": 411, "pos": 9, "npos": "8,10", "saying": "卫士：吼~~~", "x": 283, "y": 147 },
{ "icon": 402, "pos": 10, "npos": "9,11,14,15", "saying": "萧何：我闻到食物的味道了~", "x": 354, "y": 119 },
{ "icon": 401, "pos": 11, "npos": "3,10", "saying": "樊哙：多少年了，终于再次见到活人了。", "x": 433, "y": 175 },
{ "icon": 412, "pos": 12, "npos": "6", "saying": "卫士：嘶~~~", "x": 54, "y": 74 },
{ "icon": 204, "pos": 13, "npos": "6,14", "saying": "0", "x": 178, "y": 66 },
{ "icon": 403, "pos": 14, "npos": "10,13", "saying": "韩信：吾乃上将军韩信是也，尔等受死！", "x": 260, "y": 66 },
{ "icon": 400, "pos": 15, "npos": "10", "saying": "刘邦：愚蠢的凡人，敢打扰孤王的长眠~", "x": 426, "y": 52 }
]
}
, { "mapid": 103, "blist": [
{ "icon": 0, "pos": 0, "npos": "1,5,7", "saying": "0", "x": 89, "y": 266 },
{ "icon": 410, "pos": 1, "npos": "0,2", "saying": "亡魂：杀！！！杀光他们！！！", "x": 201, "y": 289 },
{ "icon": 413, "pos": 2, "npos": "1,3", "saying": "亡魂：我等八千江东子弟，足踏平他汉室！", "x": 283, "y": 249 },
{ "icon": 204, "pos": 3, "npos": "2,4,11", "saying": "0", "x": 366, "y": 228 },
{ "icon": 413, "pos": 4, "npos": "3", "saying": "亡魂：死后都得不到安宁吗？", "x": 500, "y": 249 },
{ "icon": 409, "pos": 5, "npos": "0,6", "saying": "亡魂：打扰亡者的长眠是会遭报应的！", "x": 43, "y": 186 },
{ "icon": 411, "pos": 6, "npos": "5,12,13", "saying": "亡魂：死又何惧，我已经死过一次了。", "x": 125, "y": 139 },
{ "icon": 408, "pos": 7, "npos": "0,8", "saying": "亡魂：汝等是来投靠我家霸王的吗？", "x": 156, "y": 220 },
{ "icon": 412, "pos": 8, "npos": "7,9", "saying": "亡魂：死又何惧，我已经死过一次了。", "x": 217, "y": 181 },
{ "icon": 411, "pos": 9, "npos": "8,10", "saying": "亡魂：死又何惧，我已经死过一次了。", "x": 283, "y": 147 },
{ "icon": 406, "pos": 10, "npos": "9,11,14,15", "saying": "项伯：我们还是回江东吧~", "x": 354, "y": 119 },
{ "icon": 405, "pos": 11, "npos": "3,10", "saying": "项庄：若是让我见到刘邦，必一剑杀了他！", "x": 433, "y": 175 },
{ "icon": 412, "pos": 12, "npos": "6", "saying": "亡魂：死又何惧，我已经死过一次了。", "x": 54, "y": 74 },
{ "icon": 204, "pos": 13, "npos": "6,14", "saying": "0", "x": 178, "y": 66 },
{ "icon": 407, "pos": 14, "npos": "10,13", "saying": "项梁：霸王，我们去攻打刘邦吧！", "x": 260, "y": 66 },
{ "icon": 404, "pos": 15, "npos": "10", "saying": "项羽：吾乃西楚霸王，何人来此造次！", "x": 426, "y": 52 }
]
}
]
var FuBenMapJson = [
{ "mapid": 1, "blist": [
{ "icon": 0, "pos": 0, "npos": "2,3", "saying": "0", "x": 251, "y": 311 },
{ "icon": 110, "pos": 1, "npos": "2,4", "saying": "夏恽:我有种不好的预感，我可能要跪…", "x": 100, "y": 238 },
{ "icon": 114, "pos": 2, "npos": "0,1,5", "saying": "郭胜:鼠辈，胆敢伤我！我嗑药去！", "x": 187, "y": 247 },
{ "icon": 115, "pos": 3, "npos": "0,7", "saying": "孙璋:你们忍心让我就这么酱油了？", "x": 330, "y": 264 },
{ "icon": 200, "pos": 4, "npos": "1,9", "saying": "0", "x": 76, "y": 146 },
{ "icon": 303, "pos": 5, "npos": "2,6", "saying": "栗嵩:你也要来几发吗~", "x": 168, "y": 163 },
{ "icon": 300, "pos": 6, "npos": "5,12", "saying": "毕岚:三刀已出，你已经死了！", "x": 248, "y": 115 },
{ "icon": 116, "pos": 7, "npos": "3,13", "saying": "张恭:你的剑就是你的贱~", "x": 367, "y": 182 },
{ "icon": 201, "pos": 8, "npos": "13", "saying": "0", "x": 510, "y": 190 },
{ "icon": 302, "pos": 9, "npos": "4,10", "saying": "张让:看我百步穿菊~千年杀！！！", "x": 44, "y": 59 },
{ "icon": 117, "pos": 10, "npos": "9,11", "saying": "宋典:先说好，不许打脸啊！！！", "x": 161, "y": 70 },
{ "icon": 202, "pos": 11, "npos": "10,12", "saying": "0", "x": 255, "y": 29 },
{ "icon": 304, "pos": 12, "npos": "6,11,13", "saying": "高望:如果我膝盖没中那一箭…", "x": 349, "y": 66 },
{ "icon": 301, "pos": 13, "npos": "7,8,12,14", "saying": "段珪:动我老大者，虽远必诛！", "x": 433, "y": 116 },
{ "icon": 305, "pos": 14, "npos": "13", "saying": "赵忠:你看不见我，看不见我！", "x": 502, "y": 48 }
]
}
, { "mapid": 2, "blist": [
{ "icon": 0, "pos": 0, "npos": "2,3", "saying": "0", "x": 67, "y": 259 },
{ "icon": 103, "pos": 1, "npos": "2", "saying": "精锐:前面的看好门。", "x": 55, "y": 148 },
{ "icon": 101, "pos": 2, "npos": "0,1,5", "saying": "残部:炮灰总是我来做。", "x": 132, "y": 204 },
{ "icon": 102, "pos": 3, "npos": "0,4,6", "saying": "残部:我在哪，在哪，哪…", "x": 205, "y": 232 },
{ "icon": 100, "pos": 4, "npos": "3,7", "saying": "残部:站什么岗，我拿宝箱去。", "x": 300, "y": 261 },
{ "icon": 200, "pos": 5, "npos": "2,8", "saying": "0", "x": 212, "y": 152 },
{ "icon": 101, "pos": 6, "npos": "3,9", "saying": "残部:从我身上踩过去吧！", "x": 297, "y": 192 },
{ "icon": 201, "pos": 7, "npos": "4,10", "saying": "0", "x": 417, "y": 272 },
{ "icon": 105, "pos": 8, "npos": "5,11,12", "saying": "张宝:宝箱都被抢走了。", "x": 300, "y": 88 },
{ "icon": 202, "pos": 9, "npos": "6,12", "saying": "0", "x": 358, "y": 150 },
{ "icon": 102, "pos": 10, "npos": "7,13", "saying": "黄巾残部:芝麻开门~V~", "x": 426, "y": 202 },
{ "icon": 203, "pos": 11, "npos": "8", "saying": "0", "x": 266, "y": 20 },
{ "icon": 104, "pos": 12, "npos": "8,9,13,14", "saying": "张梁:休想伤我大哥。", "x": 413, "y": 106 },
{ "icon": 103, "pos": 13, "npos": "10,12", "saying": "黄巾精锐:看门真心累。", "x": 484, "y": 146 },
{ "icon": 106, "pos": 14, "npos": "12", "saying": "张角:苍天已死，黄天当立！", "x": 484, "y": 56 }
]
}
, { "mapid": 3, "blist": [
{ "icon": 0, "pos": 0, "npos": "2,3,4", "saying": "0", "x": 62, "y": 270 },
{ "icon": 201, "pos": 1, "npos": "2", "saying": "0", "x": 35, "y": 137 },
{ "icon": 114, "pos": 2, "npos": "0,1,5", "saying": "守卫:看门没好结果。", "x": 98, "y": 186 },
{ "icon": 117, "pos": 3, "npos": "0,6", "saying": "精锐:炮灰总是我来做。", "x": 166, "y": 218 },
{ "icon": 115, "pos": 4, "npos": "0,7", "saying": "精锐:站什么岗，我拿宝箱去。", "x": 209, "y": 270 },
{ "icon": 202, "pos": 5, "npos": "2,10", "saying": "0", "x": 191, "y": 143 },
{ "icon": 124, "pos": 6, "npos": "3,11", "saying": "貂蝉:坏银要推倒我了…", "x": 275, "y": 153 },
{ "icon": 111, "pos": 7, "npos": "4,12", "saying": "守卫:从我身上踩过去吧！", "x": 284, "y": 230 },
{ "icon": 203, "pos": 8, "npos": "9", "saying": "0", "x": 116, "y": 16 },
{ "icon": 120, "pos": 9, "npos": "8,10", "saying": "李儒:来来来，尝尝中毒的味道。", "x": 191, "y": 48 },
{ "icon": 119, "pos": 10, "npos": "5,9,11", "saying": "高顺:冲锋陷阵是我的强项。", "x": 260, "y": 77 },
{ "icon": 122, "pos": 11, "npos": "6,10,12,15", "saying": "张辽:我的箭术可不是盖的！", "x": 342, "y": 101 },
{ "icon": 121, "pos": 12, "npos": "7,11,13", "saying": "陈宫:听我的名字就知道我有多成功了。", "x": 363, "y": 176 },
{ "icon": 123, "pos": 13, "npos": "12,14", "saying": "臧霸:宝箱不是你想要，想要就能要。", "x": 440, "y": 173 },
{ "icon": 204, "pos": 14, "npos": "13", "saying": "0", "x": 526, "y": 198 },
{ "icon": 125, "pos": 15, "npos": "11", "saying": "吕布:辽仔把门看好了。", "x": 398, "y": 23 }
]
}
, { "mapid": 4, "blist": [
{ "icon": 0, "pos": 0, "npos": "1,2", "saying": "0", "x": 38, "y": 283 },
{ "icon": 112, "pos": 1, "npos": "0,3", "saying": "守卫:把他们丢水里喂金鱼~", "x": 29, "y": 201 },
{ "icon": 112, "pos": 2, "npos": "0,4,5", "saying": "守卫:过了河可不许拆桥啊！", "x": 166, "y": 274 },
{ "icon": 117, "pos": 3, "npos": "1,6", "saying": "义从:想伤伦家的哈尼，不可饶恕~", "x": 80, "y": 146 },
{ "icon": 304, "pos": 4, "npos": "2,7,8", "saying": "关靖:我还会再回来的...", "x": 187, "y": 204 },
{ "icon": 115, "pos": 5, "npos": "2,9", "saying": "精锐:我有种不好的预感，我可能要跪…", "x": 291, "y": 268 },
{ "icon": 132, "pos": 6, "npos": "3,7", "saying": "公孙瓒:我也是骑白马滴~咋没人逼婚呢~", "x": 133, "y": 102 },
{ "icon": 130, "pos": 7, "npos": "4,6,11", "saying": "严纲:如果我膝盖没中那一箭…", "x": 218, "y": 140 },
{ "icon": 201, "pos": 8, "npos": "4,12", "saying": "0", "x": 309, "y": 186 },
{ "icon": 200, "pos": 9, "npos": "5,13", "saying": "0", "x": 400, "y": 263 },
{ "icon": 203, "pos": 10, "npos": "11", "saying": "0", "x": 217, "y": 43 },
{ "icon": 114, "pos": 11, "npos": "7,10,12,15", "saying": "精锐:等一下，我找把刀先~", "x": 299, "y": 97 },
{ "icon": 116, "pos": 12, "npos": "8,11,13,16", "saying": "义从:停车收费！", "x": 405, "y": 145 },
{ "icon": 305, "pos": 13, "npos": "9,12,14", "saying": "精锐:靠边停车，俺们这拍戏呢~", "x": 460, "y": 199 },
{ "icon": 200, "pos": 14, "npos": "13", "saying": "0", "x": 549, "y": 202 },
{ "icon": 202, "pos": 15, "npos": "11,17", "saying": "0", "x": 359, "y": 47 },
{ "icon": 131, "pos": 16, "npos": "12,18", "saying": "赵云:一点寒芒先到，随后枪出如龙~", "x": 476, "y": 99 },
{ "icon": 304, "pos": 17, "npos": "15,18", "saying": "田楷:敢动老子，不知道老子是城管么~", "x": 424, "y": 12 },
{ "icon": 204, "pos": 18, "npos": "16,17", "saying": "0", "x": 537, "y": 66 }
]
}
, { "mapid": 5, "blist": [
{ "icon": 0, "pos": 0, "npos": "3,4,5", "saying": "0", "x": 178, "y": 286 },
{ "icon": 203, "pos": 1, "npos": "2,6", "saying": "0", "x": 51, "y": 105 },
{ "icon": 141, "pos": 2, "npos": "1,3", "saying": "文丑:其实我的文笔很好的说~", "x": 142, "y": 111 },
{ "icon": 111, "pos": 3, "npos": "0,2,7", "saying": "精锐:你们忍心让我就这么酱油了？", "x": 206, "y": 177 },
{ "icon": 117, "pos": 4, "npos": "0,8", "saying": "精锐:姑娘，你真是条汉子~", "x": 270, "y": 225 },
{ "icon": 115, "pos": 5, "npos": "0,9", "saying": "精锐:先说好，不许打脸啊！！！", "x": 328, "y": 291 },
{ "icon": 303, "pos": 6, "npos": "1,10", "saying": "淳于琼:客官，有空没空都别来了~", "x": 147, "y": 32 },
{ "icon": 143, "pos": 7, "npos": "3,10", "saying": "沮授:一只穿云箭，千军万马来相见~", "x": 264, "y": 105 },
{ "icon": 302, "pos": 8, "npos": "4,11", "saying": "何茂:有种等着，我叫人先~", "x": 357, "y": 173 },
{ "icon": 300, "pos": 9, "npos": "5,13", "saying": "韩猛:鼠辈，胆敢伤我！我嗑药去！", "x": 423, "y": 249 },
{ "icon": 202, "pos": 10, "npos": "6,7,11", "saying": "0", "x": 275, "y": 27 },
{ "icon": 142, "pos": 11, "npos": "8,10,12,14", "saying": "颜良:人如其名，我长相不错吧~", "x": 369, "y": 85 },
{ "icon": 204, "pos": 12, "npos": "11,13,15", "saying": "0", "x": 477, "y": 148 },
{ "icon": 145, "pos": 13, "npos": "9,12", "saying": "田丰:俺只是种地的啊~", "x": 518, "y": 228 },
{ "icon": 146, "pos": 14, "npos": "11,15", "saying": "袁绍:孩儿们，男的宰了，女的抓回去！", "x": 467, "y": 26 },
{ "icon": 140, "pos": 15, "npos": "12,14", "saying": "高览:看我百步穿菊~千年杀！！！", "x": 537, "y": 89 }
]
}
, { "mapid": 6, "blist": [
{ "icon": 0, "pos": 0, "npos": "1,4,5", "saying": "0", "x": 80, "y": 298 },
{ "icon": 117, "pos": 1, "npos": "0,2", "saying": "虎豹骑：前面的车，靠边停下！", "x": 258, "y": 307 },
{ "icon": 303, "pos": 2, "npos": "1,6", "saying": "夏侯杰：吓死伦家了~~~", "x": 360, "y": 278 },
{ "icon": 115, "pos": 3, "npos": "6", "saying": "虎豹骑：开门开门，查水表了！", "x": 516, "y": 217 },
{ "icon": 115, "pos": 4, "npos": "0,7", "saying": "虎豹骑：来者何人，速速报上名来！", "x": 71, "y": 197 },
{ "icon": 111, "pos": 5, "npos": "0,8", "saying": "虎豹骑：无名小卒，尔敢阻我！", "x": 181, "y": 226 },
{ "icon": 147, "pos": 6, "npos": "2,3", "saying": "张飞：身是张翼德也，可来共决死！", "x": 407, "y": 186 },
{ "icon": 111, "pos": 7, "npos": "4,8,13", "saying": "虎豹骑：冲啊，活捉赵子龙，主公有赏！", "x": 64, "y": 116 },
{ "icon": 205, "pos": 8, "npos": "5,7,9", "saying": "0", "x": 173, "y": 126 },
{ "icon": 117, "pos": 9, "npos": "8,10", "saying": "虎豹骑：奉主公之命，活捉赵子龙！", "x": 264, "y": 156 },
{ "icon": 115, "pos": 10, "npos": "9,11", "saying": "虎豹骑：赵子龙，速速投降吧~", "x": 337, "y": 105 },
{ "icon": 115, "pos": 11, "npos": "10,12,15", "saying": "虎豹骑：主公有令，抓活的！", "x": 420, "y": 86 },
{ "icon": 131, "pos": 12, "npos": "11", "saying": "赵云:一点寒芒先到，随后枪出如龙~", "x": 516, "y": 119 },
{ "icon": 117, "pos": 13, "npos": "7,14", "saying": "曹纯：我可是纯爷们！", "x": 154, "y": 38 },
{ "icon": 300, "pos": 14, "npos": "13,15", "saying": "虎豹骑：你们忍心让我就这么酱油了？", "x": 247, "y": 38 },
{ "icon": 203, "pos": 15, "npos": "11,14", "saying": "0", "x": 347, "y": 13 }
]
}
, { "mapid": 7, "blist": [
{ "icon": 0, "pos": 0, "npos": "1,2,4", "saying": "0", "x": 62, "y": 274 },
{ "icon": 115, "pos": 1, "npos": "0,7", "saying": "联军：这么大范围的集体烧烤，好热啊！", "x": 27, "y": 158 },
{ "icon": 111, "pos": 2, "npos": "0,3,9", "saying": "联军：水上都烧得这么旺~~~", "x": 124, "y": 200 },
{ "icon": 202, "pos": 3, "npos": "2,10", "saying": "0", "x": 234, "y": 233 },
{ "icon": 112, "pos": 4, "npos": "0,5", "saying": "联军：曹贼就这么被烧死了？", "x": 295, "y": 291 },
{ "icon": 111, "pos": 5, "npos": "4,11", "saying": "联军：烧吧，死道友不死贫道，嘿嘿！", "x": 443, "y": 272 },
{ "icon": 303, "pos": 6, "npos": "7,13", "saying": "联军：孔明先生真乃神人，能呼风唤雨啊！", "x": 60, "y": 22 },
{ "icon": 117, "pos": 7, "npos": "1,6,8", "saying": "联军：额，这逆向的西风啊，你喝多了吧！", "x": 123, "y": 68 },
{ "icon": 203, "pos": 8, "npos": "7,9", "saying": "0", "x": 187, "y": 106 },
{ "icon": 117, "pos": 9, "npos": "2,8,10,15", "saying": "联军：可怜的草人兄，万箭穿心啊！", "x": 260, "y": 145 },
{ "icon": 300, "pos": 10, "npos": "3,9,11,15", "saying": "联军：-_-#黄将军是M属性的说………", "x": 327, "y": 168 },
{ "icon": 205, "pos": 11, "npos": "5,10,12", "saying": "0", "x": 404, "y": 188 },
{ "icon": 148, "pos": 12, "npos": "11,16", "saying": "黄盖:鞭笞我吧，公瑾！", "x": 557, "y": 210 },
{ "icon": 117, "pos": 13, "npos": "6,14", "saying": "联军：周都督是S属性吗？⊙﹏⊙", "x": 198, "y": 2 },
{ "icon": 205, "pos": 14, "npos": "13,15,17", "saying": "0", "x": 348, "y": 27 },
{ "icon": 112, "pos": 15, "npos": "9,10,14,16,17", "saying": "联军：大都督，诸葛亮跑了~~~", "x": 418, "y": 85 },
{ "icon": 115, "pos": 16, "npos": "12,15", "saying": "联军：跑了？那快去追啊！", "x": 531, "y": 111 },
{ "icon": 149, "pos": 17, "npos": "14,15", "saying": "周瑜：既生瑜，何生亮啊！", "x": 455, "y": 1 }
]
}
, { "mapid": 101, "blist": [
{ "icon": 0, "pos": 0, "npos": "1,2,4", "saying": "0", "x": 53, "y": 200 },
{ "icon": 141, "pos": 1, "npos": "0,3", "saying": "文丑:其实我的文笔很好的说~", "x": 61, "y": 113 },
{ "icon": 142, "pos": 2, "npos": "0,5", "saying": "颜良:人如其名，我长相不错吧~", "x": 74, "y": 288 },
{ "icon": 105, "pos": 3, "npos": "1,6", "saying": "张宝:宝箱都被抢走了。", "x": 150, "y": 86 },
{ "icon": 104, "pos": 4, "npos": "0,7", "saying": "张梁:休想伤我大哥。", "x": 164, "y": 189 },
{ "icon": 106, "pos": 5, "npos": "2,8", "saying": "张角:苍天已死，黄天当立！", "x": 171, "y": 285 },
{ "icon": 146, "pos": 6, "npos": "3,9", "saying": "袁绍:孩儿们，男的宰了，女的抓回去！", "x": 261, "y": 90 },
{ "icon": 202, "pos": 7, "npos": "4,10", "saying": "0", "x": 270, "y": 187 },
{ "icon": 132, "pos": 8, "npos": "5,11", "saying": "公孙瓒:我也是骑白马滴~咋没人逼婚呢~", "x": 286, "y": 289 },
{ "icon": 202, "pos": 9, "npos": "6,12", "saying": "0", "x": 361, "y": 55 },
{ "icon": 122, "pos": 10, "npos": "7,12,13", "saying": "张辽:我的箭术可不是盖的！", "x": 366, "y": 173 },
{ "icon": 202, "pos": 11, "npos": "8,13", "saying": "0", "x": 406, "y": 277 },
{ "icon": 131, "pos": 12, "npos": "9,10,14", "saying": "赵云:一点寒芒先到，随后枪出如龙~", "x": 455, "y": 102 },
{ "icon": 125, "pos": 13, "npos": "10,11,14", "saying": "吕布:辽仔把门看好了。", "x": 480, "y": 213 },
{ "icon": 124, "pos": 14, "npos": "12,13", "saying": "貂蝉:坏银要推倒我了…", "x": 538, "y": 134 }
]
}
, { "mapid": 102, "blist": [
{ "icon": 0, "pos": 0, "npos": "1,5,7", "saying": "0", "x": 89, "y": 266 },
{ "icon": 410, "pos": 1, "npos": "0,2", "saying": "张良：凡人，献上你的血肉吧！", "x": 201, "y": 289 },
{ "icon": 413, "pos": 2, "npos": "1,3", "saying": "卫士：吼~~~", "x": 283, "y": 249 },
{ "icon": 204, "pos": 3, "npos": "2,4,11", "saying": "0", "x": 366, "y": 228 },
{ "icon": 413, "pos": 4, "npos": "3", "saying": "卫士：嘶~~~", "x": 500, "y": 249 },
{ "icon": 409, "pos": 5, "npos": "0,6", "saying": "彭越：好久没品尝到新鲜的人肉了！", "x": 43, "y": 186 },
{ "icon": 411, "pos": 6, "npos": "5,12,13", "saying": "卫士：吸~~~", "x": 125, "y": 139 },
{ "icon": 408, "pos": 7, "npos": "0,8", "saying": "陈平：血肉，新鲜的血肉，啊~~~", "x": 156, "y": 220 },
{ "icon": 412, "pos": 8, "npos": "7,9", "saying": "卫士：吸~~~", "x": 217, "y": 181 },
{ "icon": 411, "pos": 9, "npos": "8,10", "saying": "卫士：吼~~~", "x": 283, "y": 147 },
{ "icon": 402, "pos": 10, "npos": "9,11,14,15", "saying": "萧何：我闻到食物的味道了~", "x": 354, "y": 119 },
{ "icon": 401, "pos": 11, "npos": "3,10", "saying": "樊哙：多少年了，终于再次见到活人了。", "x": 433, "y": 175 },
{ "icon": 412, "pos": 12, "npos": "6", "saying": "卫士：嘶~~~", "x": 54, "y": 74 },
{ "icon": 204, "pos": 13, "npos": "6,14", "saying": "0", "x": 178, "y": 66 },
{ "icon": 403, "pos": 14, "npos": "10,13", "saying": "韩信：吾乃上将军韩信是也，尔等受死！", "x": 260, "y": 66 },
{ "icon": 400, "pos": 15, "npos": "10", "saying": "刘邦：愚蠢的凡人，敢打扰孤王的长眠~", "x": 426, "y": 52 }
]
}
, { "mapid": 103, "blist": [
{ "icon": 0, "pos": 0, "npos": "1,5,7", "saying": "0", "x": 89, "y": 266 },
{ "icon": 410, "pos": 1, "npos": "0,2", "saying": "亡魂：杀！！！杀光他们！！！", "x": 201, "y": 289 },
{ "icon": 413, "pos": 2, "npos": "1,3", "saying": "亡魂：我等八千江东子弟，足踏平他汉室！", "x": 283, "y": 249 },
{ "icon": 204, "pos": 3, "npos": "2,4,11", "saying": "0", "x": 366, "y": 228 },
{ "icon": 413, "pos": 4, "npos": "3", "saying": "亡魂：死后都得不到安宁吗？", "x": 500, "y": 249 },
{ "icon": 409, "pos": 5, "npos": "0,6", "saying": "亡魂：打扰亡者的长眠是会遭报应的！", "x": 43, "y": 186 },
{ "icon": 411, "pos": 6, "npos": "5,12,13", "saying": "亡魂：死又何惧，我已经死过一次了。", "x": 125, "y": 139 },
{ "icon": 408, "pos": 7, "npos": "0,8", "saying": "亡魂：汝等是来投靠我家霸王的吗？", "x": 156, "y": 220 },
{ "icon": 412, "pos": 8, "npos": "7,9", "saying": "亡魂：死又何惧，我已经死过一次了。", "x": 217, "y": 181 },
{ "icon": 411, "pos": 9, "npos": "8,10", "saying": "亡魂：死又何惧，我已经死过一次了。", "x": 283, "y": 147 },
{ "icon": 406, "pos": 10, "npos": "9,11,14,15", "saying": "项伯：我们还是回江东吧~", "x": 354, "y": 119 },
{ "icon": 405, "pos": 11, "npos": "3,10", "saying": "项庄：若是让我见到刘邦，必一剑杀了他！", "x": 433, "y": 175 },
{ "icon": 412, "pos": 12, "npos": "6", "saying": "亡魂：死又何惧，我已经死过一次了。", "x": 54, "y": 74 },
{ "icon": 204, "pos": 13, "npos": "6,14", "saying": "0", "x": 178, "y": 66 },
{ "icon": 407, "pos": 14, "npos": "10,13", "saying": "项梁：霸王，我们去攻打刘邦吧！", "x": 260, "y": 66 },
{ "icon": 404, "pos": 15, "npos": "10", "saying": "项羽：吾乃西楚霸王，何人来此造次！", "x": 426, "y": 52 }
]
}
]
